[{"DataSource":"stackoverflow.com","CommentId":"26397263","Text":"Are you positive the file &quot;partnersList.csv&quot; is available in the same folder as your R files? Shiny-server uses the same shiny package so there should be no difference. You could try to set the full path to the data file just to make sure.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26361385","Text":"Still have no <code>initial_patient_distribtion</code> and cannot see why you think the current output is wrong.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26337266","Text":"+1 for the link! Thanks. I have started reading it.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26335632","Text":"@user1971988  see my edit and Read the package vignettes as well -- they are brilliant and illuminating","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26335498","Text":"Can you point me to something that will help me understand why the copying warning was showing up?\n\nWas that statement being construed as: <code>.internal.selfref </code>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26335352","Text":"Yes, that solves the problem. Thank you very much.\nI still see it in a list format, which is why I am struggling to come out of the list based commands. Guess have to change that.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26335156","Text":"@Roland - Yes. That did not fix the problem.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26327397","Text":"@DirtStats - I ran into that problem as well with my sample data, but I didn&#39;t know if it was a problem with my data, or if there was some sort of underlying problem with my solution. It might be worth flagging the moderators to move your question to stats.stackexchange.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26326913","Text":"Thanks a lot, Jim!  This seems to work for my model &amp; data.  However, now lsmeans doesn&#39;t like the model - it freezes up chewing through memory and processing power whenever I try to run the model through it, even when I&#39;m not using the new interaction terms.  And if I do use the new interaction terms it gives a bunch of NA&#39;s as the results.  Have you run into that problem before?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26326637","Text":"<code>+ coord_map(&quot;lambert&quot;, lat0=25, lat1=50)</code> projects the maps (into lambert, in this example)","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26322888","Text":"@AdamRyczkowski I named it after the izip function in the Python itertools package.  In fact, much of the iterators and foreach packages was copied from Python.  foreach attempts to copy Python list comprehensions, for example.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26321903","Text":"ah thats it, good catch :)","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26321783","Text":"This is almost perfect--I&#39;d like some states to be in multiple regions but this is easily done by copying them and rbinding them (so there are two sets of washington rows, for example--one in weco and one in west).  Thanks a ton! I was really starting to believe this wasn&#39;t possible. The stretched-out states issue is just due to the fact the map isn&#39;t using projected coordinates, which isn&#39;t a big deal.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26321541","Text":"Amro, see below -- the problem was with /usr/lib/R/library/stats/libs/stats.so, not with /usr/bin/Rscript.  Your reply got me going in the right direction.  Thanks!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26321428","Text":"Great! I assumed it was about iterating through compressed (zipped) file... I&#39;ve just made my own izip iterator, and even named it <code>izipiter</code> to avoid name conflict with the <code>izip</code>... I feel so silly now. At least I&#39;ve learned something about iterator construction. Thank you!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26321109","Text":"@TimothyW.Hilton: can you show the output of <code>ldd</code>? Pay attention to the path of the various shared libraries..","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26320035","Text":"thanks for your response!  No luck, though.  !ldd /usr/bin/Rscript (within Matlab) and ldd /usr/bin/Rscript (from the shell) produce the same output except for the hexidecimal addresses.  I think it is OK that the hex addresses differ?  Unsetting LD_LIBRARY_PATH within Matlab produces the same error as before...","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26319997","Text":"Thanks for your response -- I&#39;m confused by your question though.  /usr/lib/R/library/stats/libs/stats.so does exist.  How would I determine where my OS thinks it should be?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26315939","Text":"It&#39;s appropriate, but it&#39;s not going to get much attention until you post code that will let someone reproduce the problem.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26310564","Text":"@shadow Thanks, survSplit looks really useful. I found a solution without using it though (see below), but perhaps using survSplit (or code based on it) could be more efficient/concise.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26309466","Text":"Thanks. I will remove my question to CrossValidated. Is it appropriate, however, to ask question about &quot;duplicate error&quot; here?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26303904","Text":"A sample rule for illustrative purpose:  &quot; PetalLength &gt; 2.6  AND  PetalWidth &gt; 1.65  AND  SepalLength &gt; 6.6  &quot; Class: setosa.  This is the rule I worked with","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26303650","Text":"Ok, so I have made some progress on this. The following is what I have got:  rule.v &lt;-rules[2,]\n# Generate the query\nquery &lt;- paste(&quot;SELECT Species, count(Species) FROM dataset WHERE &quot;, rule.v, &quot; group by Species&quot;, sep=&quot;&quot;)\n# Execute and print the results\nprint(sqldf(query))  Here rules is the dataset of rules I have, which is over 1000. I am working with the iris dataset, and Species is the target variable. So this is giving me the kind of output I want, but I wish to now use the same query on all the rules. How can I get the print command to be stored in a data frame with all the values?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26297205","Text":"What I don&#39;t like on these more &quot;correct&quot; ways is that this is not the way I normally use data.frames. The <code>df@data&#91;1, &#39;zinc&#39;&#93;</code> is close to what I use normally. And more importantly, with <code>@data</code> <b>you can work with it as a dataframe - indexing multiple columns by name or index:</b> <code>meuse@data&#91;,c(&#39;zinc&#39;,&#39;cadmium&#39;)&#93;</code> unfortunatelly would not work in the <code>meuse&#91;&#91;&#93;&#93;</code> form.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26297054","Text":"Thanks! 1) so you think it is a bug that those 3 statements do not work? Can someone fix it? 2) is the <code>@data</code> feature of <code>Spatial*DataFrame</code> documented somewhere? One could take this as a criteria wheter it is reasonable to use it. It seems that they also use the form <code>df&#91;&#91;&#39;zinc&#39;&#93;&#93;&#91;1&#93;</code> <a href=\"http://cran.r-project.org/web/packages/sp/vignettes/intro_sp.pdf\" rel=\"nofollow\">intro_sp vignette</a>.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26296845","Text":"I have tried using the sqldf package, however, the issue I am facing is that a rule can&#39;t be read back as a rule into R. What I can do is unlist(rule, use.names = FALSE)[-1], which gives me the attributes from the rule like &quot;PetalLength &gt; 4.95&quot; &quot;PetalWidth &gt; 1.75&quot;. I want to use these aspects from each rule and then pass them through the dataframe to see which elements are classified correctly, and which ones incorrectly.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26294964","Text":"It&#39;s because it is for developers to hide inside the code they provide to users, i.e. it&#39;s subverting the API if you don&#39;t use the methods provided. There&#39;s no danger in it, except that the developers might change the API and your code won&#39;t work (I think it&#39;s safe in this instance but avoid it generally if you can. The Spatial* classes should have done more to help here, it might be because  the DataFrame part was originally implemented separately, before extending the actual data.frame in R, long story I guess).","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26294419","Text":"@CravingSpirit, done. I didn&#39;t post it as an answer originally because it looked like you had already sort of found an answer with <code>read.fwf</code> -- but I&#39;m guessing you were missing the <code>textConnection</code> part. For some reason, while <code>read.table</code> and so on got a <code>text</code> argument, <code>read.fwf</code> is still stuck with a <code>file</code> argument.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26294190","Text":"Hi @DrDom, i tried specifying <code>classes = &quot;data.frame&quot;</code> but no success. Anyway thanks.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26292965","Text":"I got it now. Thank you.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26292328","Text":"All free scales will do is allow the <i>ranges</i> to vary. But faceting is , by definition, intended for when the scales are essentially the same. You&#39;re proposing entirely different orderings, hence entirely different scales. The only option I know of is to use grid.arrange as mentioned below.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26292269","Text":"@joran, (1) I saw the warnings and ignored them after not quickly figuring out what they were telling me. (2) I was expecting &quot;scales=&#39;free&#39;&quot; in facet_grid would let me have independent scales for each plot. Want to try converting y axis into continuous variable.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26291955","Text":"Loops it is. Thanks all. Is there a way to clear this question if there are no &#39;answers&#39; posted?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26291895","Text":"So ... is &#39;/usr/lib/R/library/stats/libs/stats.so&#39; really where your OS thinks it should be?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26291231","Text":"what do you want it to be filled with?  <code>with(S1, table(DB_num, AD_num))</code> might get you close...","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26290685","Text":"General request for tool recommendations are really a sign that you need statistical advice. Please use the appropriate stackexchange venues for getting such advice.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26290637","Text":"&quot;LogitTV.Rda&quot; might be the name of the file, but that has nothing to do with what is the name of the object that was loaded from it.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26290472","Text":"If you run <code>count.fields</code> on that file it appears that it only has 8 lines of data, and that the number of variables per row has a range of 22897-75294.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26290221","Text":"I haven&#39;t used scan or readLines before. It seems they just read item by item. How would I get it in a dataframe format with the different rows?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26289676","Text":"<code>weight&#91;na.omit(match(y,x))&#93;</code>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26289649","Text":"@AnandaMahto That&#39;s very nice. Why don&#39;t you post it as an answer? I would be very glad to accept it.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26289634","Text":"<code>readLines</code> is another helpful tool for this.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26289539","Text":"<code>read.table</code> expects the number of elements in every row to be the same. You should use <code>scan</code> instead.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26289406","Text":"And this looks relevant, despite a completely different approach: <a href=\"http://stackoverflow.com/a/3085903/1036500\">Keeping Track of Word Proximity</a>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26289363","Text":"It decreases the white space at the expense of distorting the maps.  I&#39;d like a solution that maintains the scale of the maps within each plot (x:y=1:1) and between plots (one unit long on each map is the same space on the screen).","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26289254","Text":"In general I suspect the simplest method for analysing word proximity is going to be based on <a href=\"http://www.regular-expressions.info/near.html\" rel=\"nofollow\">regex</a>, which I have very limited abilities with! It might be worth another question to see if someone can translate that regex to R so you can run in on raw text without the corpus and dtm steps.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26289236","Text":"@mdsumner, wow, so many possibilities! But what do you say about the <code>@</code> operator, why should I avoid it? This is not only interesting but seems important; please post it as your own answer!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26289235","Text":"A few comments... you can do <code>data.table()</code> instead of <code>as.data.table(as.data.frame())</code>, your bigram tokeniser is set to get one-grams and two-grams which will result in more than double counting (mine just does 2-grams, and then I subset to remove duplicates), and I&#39;m curious what is the advantage of <code>data.table</code>  here? My answer is just vectors and sparse matrices, I&#39;m not sure if you gain much in speed or memory by using <code>data.table</code>, have you benchmarked?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26289230","Text":"I&#39;m not seeing how this fixed this issue. If it can, could you demonstrate how? I provided fully usable sample code...","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26289198","Text":"well, if you say so","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26289110","Text":"This doesn&#39;t address the fact that arrangeGrob is padding blank space around the first graph.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26289054","Text":"Also this works so you can avoid $:  meuse[[&#39;zinc&#39;]][1] &lt;- NA","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26289017","Text":"you can pass <code>widths = unit(c(1, 2, 3), &quot;null&quot;)</code> to <code>arrangeGrob</code>, and tweak the relative factors manually.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26288949","Text":"meuse$zinc[1] &lt;- NA  It seems that other pathways to this are not provided as methods, but they could be added. I&#39;ll have a look into that. You could expect that meuse[1,&#39;zinc&#39;] &lt;- NA, meuse[1,][[&#39;zinc&#39;]] &lt;- NA, and meuse[1,]$zinc &lt;- NA should all work. It&#39;s probably best to avoid the @ operator if you can.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26288627","Text":"Might have worked with <code>as.POSIXct</code> but <code>as.Date</code> seemed doomed from the very start.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26288614","Text":"-1 <code>?Date</code> tells you &quot;Dates are represented as the number of days since 1970-01-01&quot; and it doesn&#39;t mention times anywhere. The &quot;See Also&quot; section points you to &quot;&#39;DateTimeClasses&#39; for date-time classes&quot;, which would have answered your question.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26288227","Text":"There&#39;s no way that <code>mtx^i</code> is going to work with a varying mtx argument.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26287761","Text":"@Ben cheers, see update which was very strongly inspired by your answer. We&#39;re almost there!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26287453","Text":"Done, see above.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26287385","Text":"Done, see above.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26287319","Text":"please, have a look at the edited question","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26287292","Text":"\\uc5 worked for me!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26287068","Text":"Try <code>xlab(&quot;\\uc5&quot;)</code> or <code>xlab(&quot;\\u212b&quot;)</code>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26286880","Text":"@Peteris If you edited your question to include the ouput of <code>dput(head(df))</code> -- i.e. made the code in your question reproducible -- it would make it easier to answer.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26286819","Text":"Can you show <code>dput(df)</code> (or perhaps <code>dput(head(df))</code> if it&#39;s large?)","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26286750","Text":"If someone could write up an answer that mentioned vectorization or <code>transform</code> and explained the behavior I observed with <code>apply</code>, that would be excellent.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26286715","Text":"@aguiar, I&#39;d suggest adding the tag &quot;algorithm&quot; so that people contributing there can have a look at it and say/show if there&#39;s a (better) way (because looking at all ways and checking for sum of 451 is pretty exhaustive) algorithmically. Then it should be, with some effort, possible to convert it into R-code.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26286398","Text":"You could, of course, do that but you will have the same parsing difficulties that you are currently experiencing. Try it on a small test case. In your test case there would be two offending doble quotes, one next to the first dbl-quotes.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26286141","Text":"Yeah... perhaps it&#39;s not feasible hum?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26286073","Text":"@DWin See edit. If I changed the quoting double-quotes to pipes then I could set <code>quote=&#39;|&#39;</code> in <code>read.csv</code>.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26285660","Text":"aguiar, I don&#39;t know if you realize, but there are about <code>choose(450,4) ~ 1e9</code> such combinations...","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26285450","Text":"I don&#39;t see how changing all &quot;\\&quot;&quot; to &quot;|&quot; would be helpful. I think you might need a regex solution (probably implememted in awk) that will find instances of something like: &quot;,&quot;\\&quot;[^,]{0,}\\&quot;[^,]{0,}\\&quot;,&quot; , i.e. three double-quotes between commas.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26285097","Text":"Have you tried making a dtm of bigrams and then subsetting that?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26285063","Text":"So, since I have to count the &quot;5/5&quot; twice, the numbers in this category go from 0 to 225 (it would go from 0 to the total/2 if the total were an even number).","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26284611","Text":"Have you got your pdf2txt <code>PATH</code> configured correctly? See here for details: <a href=\"https://stat.ethz.ch/pipermail/r-help/2008-November/180201.html\" rel=\"nofollow\">stat.ethz.ch/pipermail/r-help/2008-November/180201.html</a>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26284440","Text":"There are a few notes at <a href=\"https://github.com/hadley/devtools/wiki/Functionals#converting-loops-to-functionals-and-when-its-not-possible\" rel=\"nofollow\">github.com/hadley/devtools/wiki/&hellip;</a> about when for loops are the natural solution.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26284403","Text":"Your examples are fine, except the last one. The numbers should be positive only.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26284348","Text":"Hmm, hard to tell, but it might be you have a bare <code>@</code> somewhere.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26284330","Text":"Ok again, is there a limit each of these values can take? For ex: can the values be: (0,0,0,0,451), (0,0,0,1,450), (10^6, -2*10^6, 0,0, 451)...?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26284211","Text":"Yes, I&#39;m generating new numbers.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26284008","Text":"Thanks @Thomas. Will post it there.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26283881","Text":"These are not exactly combinations as you&#39;re generating new numbers? I may be wrong or have misunderstood but I think there are infinite combinations in which you can add any set of numbers to get a particular number... Ex: I find it&#39;s kind of like, a + b = 2, what&#39;s <code>a</code> and <code>b</code>? Please correct me as to what I&#39;ve gotten wrong...","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26283274","Text":"If you want Dates, use <code>as.Date</code>.  If you want times, use <code>as.POSIXct</code>.  Don&#39;t convert to <code>POSIXlt</code> unless you need to extract a component (hours, minutes, etc.)  Don&#39;t use <code>POSIXlt</code> with a <code>data.frame</code> because it is a list which is slower and uses more memory than POSIXct.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26283174","Text":"<code>as.POSIXlt</code> is vectorized, so <code>df$time &lt;- from.timestamp(df$time)</code> should work.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26282303","Text":"Those are probably the row names and not a column.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26281829","Text":"I clicked this question just to learn about &quot;tree digit numbers&quot;. I&#39;m disappointed that it was a typo.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26281544","Text":"@ joran and @ Ben Bolker: link for download the data.txt: <a href=\"http://www.mediafire.com/view/629mzqqjtl471qi/data.txt\" rel=\"nofollow\">mediafire.com/view/629mzqqjtl471qi/data.txt</a>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26281135","Text":"Hello and welcome to SO.  Generally, the questions here are regarding concrete programming obstacles.  While I hate to vote to close a question for a first post, this really is something that is easily found with a basic search.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26279733","Text":"You can read your file as usual (say <code>SplitMe &lt;- read.csv(&quot;test.csv&quot;)</code>). Then, presuming your third column is called &quot;V3&quot;, you can use <code>read.fwf(file=textConnection(SplitMe$V3), widths = rep(1, 20))</code> to split it. Combining the two: <code>cbind(SplitMe&#91;-3&#93;, read.fwf(file=textConnection(SplitMe$V3), widths = rep(1, 20))</code> should do it with this example. Replace the numbers as needed for your actual data.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26279169","Text":"<code>strsplit</code> should work fine with <code>split = &quot;&quot;</code>.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26279164","Text":"What have you tried so far? Did you find <code>strsplit</code>?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26278779","Text":"use as.character first","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26278745","Text":"Making new data frames for a new layer, or creating whole new variables is what you signed up for when you started using ggplot. It isn&#39;t called &quot;the grammar of graphics&quot; for nothing. If what you try isn&#39;t grammatically correct, well...","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26278719","Text":"You need to tell ggplot where you want the labels... how could it know you want them at the top of each bar... take a  look <a href=\"http://stackoverflow.com/questions/6455088/how-to-put-labels-over-geom-bar-in-r-with-ggplot2\">here</a>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26278676","Text":"Without some sample data or a good overview of it, we really can&#39;t help much further.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26278211","Text":"one way is to simply keep going until you have rolled all values at least once","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26277996","Text":"show your co-workers Chapter 4 of the Inferno <a href=\"http://www.burns-stat.com/pages/Tutor/R_inferno.pdf\" rel=\"nofollow\">burns-stat.com/pages/Tutor/R_inferno.pdf</a> ... it&#39;s good to vectorize <i>if you can</i>, but your problem statement above sounds a lot like a <code>while</code> loop embedded in a <code>for</code> loop to me ...","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26277686","Text":"Ive been avoiding loops based on past experience and co-worker scorn. I haven&#39;t written one for this, but I&#39;ll add one in pseudo-code above.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26276816","Text":"can you post the text of &quot;data.txt&quot;, or a link to it, so that the example is reproducible??","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26276768","Text":"Show us what you&#39;ve tried.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26276741","Text":"factor your variable first, then pass it as normal.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26276560","Text":"why the no-looping constraint? Feels like it would be best to come up with a workable solution first, then (if it&#39;s too slow or inelegant) look for vectorized and/or Rcpp-enhanced versions. Can you show what you&#39;ve tried so far?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26276410","Text":"thanks @Justin  - Now how would the colour be handled in aes_string?  I want to colour by year and aes_string is not liking when my colour statement is left as-is.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26276391","Text":"It looks like this is a programming issue. If so, this would be better served on Stack Overflow, and a moderator can migrate this question for you (flag this post, but don&#39;t repost on SO).","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26274600","Text":"@RabidHealer, sorry, but your sample data doesn&#39;t even closely resemble what you originally asked. Can you please edit your question to include a minimal <i>working</i> example that demonstrates what you are trying to accomplish.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26274054","Text":"what happens if the binary data happens to randomly contain the termination string <code>&lt;&#47;BinData?&gt;</code> ??  - Binary data in XML files should be base64 encoded or similar.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26273127","Text":"(1) Did you not notice all the warnings thrown by your code? (2) What you are attempting is not possible (using faceting). It would require different orderings of the y axis for each row of facets.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26272909","Text":"The data in <code>t</code> is some sort of special S4 class that can&#39;t be coerced to what rbind needs. But it&#39;s impossible for me help any more because (a) I don&#39;t know what package you&#39;re using for these commands, and (b) I don&#39;t have your example data.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26272699","Text":"You might want to look at <a href=\"http://faculty.washington.edu/ezivot/econ424/Working%20with%20Time%20Series%20Data%20in%20R.pdf\" rel=\"nofollow\">faculty.washington.edu/ezivot/econ424/&hellip;</a>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26272099","Text":"you are welcome.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26271805","Text":"Ditto to what @joran said.  If you&#39;re going to have varying column names, you can use <code>aes_string</code> to deal with your <code>mod_ws</code> variable:  <code>aes_string(x=&#39;Date_Rank&#39;, y=mod_ws)</code>...","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26271467","Text":"<code>x=chrt_data$Date_Rank,y=chrt_data&#91;&#91;mod_ws&#93;&#93;</code>: Don&#39;t do that. Map aesthetics to variable <i>names</i> only. That&#39;s why you also specify the data frame, so ggplot knows where to look for the variables.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26271383","Text":"the only thing I can think to do at the moment is: for (j in 1:length(filenames){ b&lt;-basename(filenames)\nsheetname&lt;-b[j]} but this isn&#39;t working as if I place it inside the loop it produces too many sheets, so I&#39;m not quite sure what I can do with this","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26271166","Text":"Thank you for this tip !","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26270726","Text":"The message you get is related to printing of stuff to the screen, not to how much data R can work with. You simply need to assign the result to an object <code>result = do.call(rbind, list.dataset_2011)</code>.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26269990","Text":"@ joran: I tried but there is no difference!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26269984","Text":"You may want to look at the <code>?survSplit</code> function in the <code>eha</code> package. <code>df &lt;- survSplit(dat, cut=as.Date(paste(1950:2013, &quot;01&quot;, &quot;01&quot;, sep=&quot;-&quot;)), end=&quot;End&quot;, start=&quot;Birth&quot;, event=&quot;ev&quot;,id=&quot;id&quot;)</code>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26269871","Text":"Thank you for your answer. I am a &quot;newbie&quot; in R, so I didn&#39;t know this command. It appears to be a good idea despite the fact that I get a message :  [ getOption(&quot;max.print&quot;) is reached. Maybe I can&#39;t work on that much data...","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26269841","Text":"@ Ronald: Each vector has 3 columns.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26269824","Text":"A shot in the dark: try not using <code>t</code> as your variable name. Try it again, but name it <code>t1</code> or something.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26269740","Text":"@ Ronald:  &quot;tt=do.call(rbind,t)&quot;:\nError in .Method(..., deparse.level = deparse.level) : \n  no method for coercing this S4 class to a vector","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26269607","Text":"What does &quot;don&#39;t work&quot; mean? The two vectors are of different length, which should result in a warning if you <code>rbind</code> them.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26269304","Text":"May be you need to specify <code>classes = &quot;data.frame&quot;</code> in <code>rapply</code> function?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26269138","Text":"Why don&#39;t you do <code>do.call(rbind, list.dataset_2011)</code> since all data.frames seems to have the same number of columns?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26269083","Text":"Sorry for cross-posting. The message I sent to r-sig-mixed-models@r-project.org was not appearing correctly. Thanks for your help!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26268791","Text":"this is cross-posted to the r-sig-mixed-models@r-project.org mailing list <a href=\"http://news.gmane.org/gmane.comp.lang.r.lme4.devel\" rel=\"nofollow\">news.gmane.org/gmane.comp.lang.r.lme4.devel</a> . I will probably answer there.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26267686","Text":"Sorry for not making it clearer: I want to be able to use the model to predict the growth of trees of a given size and competitive environment (fixed effects), and  growing in specific treatments and/or plots (random effects). Although <code>predict</code> will allow me to do this, for lmer models it will not provide SE for the predictions. I am trying to find a way to incorporate the uncertainty in the model into my predictions so that I can make meaningful comparisons.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26267199","Text":"I edited my post. I hope that gives you the missing informations. Thanks.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26267082","Text":"It is not obvious to me what exactly you are predicting: Are you predicting for a specific treatment and a specific plot? Or for a specific treatment and the plot population? Possibly related: <a href=\"http://stackoverflow.com/a/14435982/1412059\">Extract prediction band from lme fit</a> (including links and comments).","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26266308","Text":"What have you tried....?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26265404","Text":"What is the exact line of code you&#39;re running that gives the error? Also, what is <code>i</code>, and what are the values in <code>fti</code>?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26265337","Text":"&#204;s there any chance to plot it &quot;from scratch&quot;? And how could I do so?...","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26264450","Text":"Maybe contact the authors? Because <code>plotvglm</code>returns <code>stop(&quot;this function hasn&#39;t been written yet&quot;)</code> :(","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26263141","Text":"If your object (matrix, dataframe, etc.) is called <code>x</code> and you type <code>dput(x)</code> into your R console. It will give you some output. If you copy and paste that output into your question, we will be able to see exactly what your data look like.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26306217","Text":"Use ggplot&#39;s <a href=\"http://docs.ggplot2.org/current/geom_tile.html\" rel=\"nofollow\"><code>geom_tile</code></a>, or potentially <a href=\"http://docs.ggplot2.org/current/ggfluctuation.html\" rel=\"nofollow\"><code>ggfluctuation</code></a>.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26262326","Text":"I am afraid I dont know how to change the presentation of the data, I dont know how to use dput()","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26261914","Text":"Can you replace your current presentations of data with the output of <code>dput(x)</code> and <code>dput(Y)</code>? It&#39;s a lot easier to give help if we can see the actual form of the data.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26260733","Text":"Also show us <code>ENV</code>. If <code>ENV</code> truly only contains numbers there are probably easier ways than using regular expressions.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26260411","Text":"@Roland: OK, modified iris would be good choice. Are there really any security issues? In general, I do agree that availability of external dataset is not guaranteed (and I won&#39;t use it next time), however this specific dataset is available at this URL since 1994.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26260250","Text":"I edited your post and removed <code>print(x)</code> since it is both meaningless and highly misleading. I hope you do not mind.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26260198","Text":"Why do you use regex for this? What is your input (i.e., give us an example of <code>EN</code>)?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26259935","Text":"@TomasGreif, you can take any of them and add the code to convert to different types as part of your minimal example.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26259922","Text":"I would have used the iris dataset and made one of the numeric columns integer. I dislike downloading data for security reasons and it also isn&#39;t guaranteed that the data will be available for download in the future.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26259762","Text":"@Roland Noted. What built-in dataset with many columns and with many data types would you recommend? From my point of view the dataset is really small, just 78KB, but I&#39;ll try to choose smaller next time.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26259585","Text":"sorry I forgot the computation of <code>Tpred</code> - fixed","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26258997","Text":"Btw., why do you have to include downloading this rather big data.frame in your reproducible example? Next time you should just use one of the build-in datasets.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26258407","Text":"I do this kind of subsetting frequently, that is why I&#39;ve tried to create this function - to simplify my life.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26258393","Text":"This question appears to be off-topic because it is about conceptual issues in software development and belongs on <a href=\"http://programmers.stackexchange.com/\">Programmers</a>.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26258344","Text":"Have you tried <code>DF &lt;- readRDS(fileAsDataFrame); DT &lt;- data.table(DF)</code> to rule out that this step creates the problem?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26257948","Text":"Apologies. It is a dataset with millions of rows. Please give me some time. I will post a reproducible example soon.\n\nThe data table was created as: DT = data.table(readRDS(fileAsDataFrame))","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26257943","Text":"I&#39;m not sure I fully understand your question, but why not just something like <code>df&#91;sapply(df, function(x) is.integer(x) || is.logical(x))&#93;</code>?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26257654","Text":"How did you create the data.table? What exactly is <code>do something</code>? Please provide a <a href=\"http://stackoverflow.com/a/5963610/1412059\">reproducible example</a>.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26257507","Text":"This may be better answered on <a href=\"http://stats.stackexchange.com\">Cross Validated</a>.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26255937","Text":"yes i&#39;ve tried my query is it possible to do it using if -else loop in R","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26254827","Text":"Have you tried any of the methods listed here: <a href=\"https://stat.ethz.ch/pipermail/r-help/2010-July/244299.html\" rel=\"nofollow\">stat.ethz.ch/pipermail/r-help/2010-July/244299.html</a>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26251054","Text":"Can you post a reproducible form of your data (hard to tell which column &quot;F10&quot; etc are in).","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26250666","Text":"rowwise computations on data.frames are slow and inefficient. (<code>apply</code> coerces data.frames to matrices. <code>data.frames</code> are stored by columns.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26250629","Text":"I&#39;m a little confused by your new example (aag -&gt; G); if you can give some context about the bioinformatic goal, it maybe that the <code>Biostrings</code> package can do it easily ...","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26250620","Text":"Thx, edited; this is a simplified reproducible.. my application requires data frames and time series","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26250571","Text":"Your example is a list of matrices, not a list of data.frames...","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26250048","Text":"@ agstudy: I defined the first column as a vector, and then use $ to replace, but I didn&#39;t work.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26249846","Text":"What have you tried....?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26400296","Text":"This is actually much faster than the read.fwf() approach!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26362728","Text":"This worked nicely but what if I want to make a calculation (or say, set to zero) all the W1&#39;s without extracting them from the list?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26361201","Text":"If you do not post complete updated code, input data, and any error messages in a formatted edit to the current question, there&#39;s no way to see what you mean by &quot;not working&quot;. It&#39;s pretty much impossible to read multi-line code and errors in comments.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26359487","Text":"@HongOoi, great point!  whoops.. it&#39;s been many, many years","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26358954","Text":"@BenBolker writing loadedObj &lt;- load(&quot;~/Home Automation/LogitTV.Rda&quot;) then write.csv(get(loadedObj), file=&quot;LogitTV.csv&quot;, row.names = FALSE) worked. Thanks again for you help.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26354291","Text":"Thank you much appreciated!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26341590","Text":"Thanks so much for this detailed explanation! It was very clear :-)","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26336946","Text":"yes you are correct, I&#39;m still trying and almost figured out a way to do so, will post as soon as I&#39;m done. thanks","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26330097","Text":"for(i in 2:length(aaa) ) is not working :-(","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26329911","Text":"&gt;  for (i in 2:5){ \n+         trans_matrix_dasa_no2nd[1,] &lt;- c(aaa[i],bbb[i],ccc[i])\n+         cycle_patient_distribution_dasa_no2nd[i,] &lt;-\n+                cycle_patient_distribution_dasa_no2nd[i-1,]%*%    \n+                                       (trans_matrix_dasa_no2nd)\n+                  }\nError in <code>&#91;&lt;-</code>(<code>*tmp*</code>, i, , value = c(210, 323, 467)) : \n  subscript out of bounds\n&gt; \n&gt; cycle_patient_distribution_dasa_no2nd\n     [,1] [,2] [,3]\n[1,] 1000    0    0\n[2,]  700  200  100\n[3,]  420  310  270","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26329898","Text":"&gt; initial_patient_distribtion &lt;- c (1000,0,0)\n&gt; aaa &lt;- c(1,0.7,0.6,0.5,0.4)\n&gt; bbb &lt;- c(1, 0.2,0.3, 0.4, 0.5)\n&gt; ccc &lt;- c(1, 0.1,0.1,0.1)\n&gt; \n&gt; trans_matrix_dasa_no2nd &lt;- matrix (,nrow=3,ncol=3)\n&gt; trans_matrix_dasa_no2nd[1,] &lt;- c(aaa[i],bbb[i],ccc[i])\n&gt; trans_matrix_dasa_no2nd[2,] &lt;- c(0,0.5,0.5)\n&gt; trans_matrix_dasa_no2nd[3,] &lt;- c(0,0,1)\n&gt; \n&gt; \n&gt; cycle_patient_distribution_dasa_no2nd[1,] &lt;-initial_patient_distribtion","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26329884","Text":"Perhaps use <code>for(i in 2:length(aaa) )</code>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26329833","Text":"Thanks! Almost solved my problem, only now I am out of bounds:","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26328127","Text":"It worked, but it takes a long time. So, I&#39;m just getting it in the correct form and saving that as a txt file so I can read that in anytime after that without the long wait.\nThank you!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26325525","Text":"@ScottDavis, did you try <code>row.names=FALSE</code> in the <code>write.csv()</code> call?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26325498","Text":"@Se&#241;orO, I agree. I think <code>load</code> might have been written back in the days when we still thought <code>attach()</code> was a good idea too.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26322563","Text":"@BenBolker the command created a .csv file, but added a column numbering rows. For example, excel column &quot;A&quot; row 1 displays nothing, row 2 displays 1, row 3 displays 2, ect. Deleting column &quot;A&quot; and moving the other 4 rows over fixed the problem.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26317522","Text":"If you run the command line by line, you don&#39;t need the multiline option. But if you have read the entire file into <code>$subject</code>, then you do need it.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26316125","Text":"That approach makes more sense, I just find it frustrating that <code>load</code> creates an object in your workspace in the same way <code>&lt;&lt;-</code> would inside a function. Personally I think <code>load</code> should return the object itself.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26316014","Text":"Why do you need the multiline option? I ran this in the command line: <code>perl -p -e &#39;s&#47;(?&lt;!,)(?&lt;!^)&quot;(?!,|$)&#47;&quot;&quot;&#47;mg;&#39; file1.csv &gt; file2.csv</code>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26315733","Text":"Then use <code>cbind( rownames(df.coef), df.coef)</code>. And saying a function &quot;doesn&#39;t like that&quot; is not particularly helpful. If the problem is that the rownames are lost then the cbind maneuver will work. If the problem is that the rownames create an error, then you are toast, since dataframes always have rownames.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26315644","Text":"thanks but the actual code does not work. Your example works though.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26313251","Text":"Glad I could help. You also might want to try experimenting with this strategy using other data structures like a matrix in case casting your data to a df slows down the operation. As you can see I only tried this out on 10 paired records, but I&#39;m assuming you probably have significantly more data since you&#39;re using foreach and iterators.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26312454","Text":"I just remembered that I think the space parameter is only implemented for facet_grid. I think usually you can get facet_grid to function similarly to facet_wrap though (not in front of R right now to try it out).","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26312024","Text":"This gives me a dataframe of only 4 variables, the variable which contains the coefficient name is not a variable in the dataframe.  It&#39;s still a dimname, and sqlSave doesn&#39;t like that as far as I can tell.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26308853","Text":"@ sgibb: Thanks a lot.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26298926","Text":"Surely if it was D&amp;D, it would be 3d6 <i>AHEM</i>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26298363","Text":"while this is not what i need to calculate (I edited the question accordingly), your snippet of code is still purely useful for something else i need to analyze! Tnx allot for your contribute!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26298013","Text":"ehehe tnx, it&#39;s not my homework. Unfortunately, I&#39;m too old to be at college ;) We just decided to spice up our RPG <i>cough*non D20-based*cough</i> design activities with more statistical rigor. I&#39;m not totally new to R, but I usually use it for analysis rather than real programming. But lemme try your code now! :) tnx for your answer!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26296664","Text":"@StephenRewitz See my edit, which uses <code>mapply</code> and a vector of colors.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26295252","Text":"So you mean, for every horizontal line, only draw it &#39;to the extent of your data&#39;. Do you mean in that bin in between the grid lines? A more specific example would help here.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26295120","Text":"many thanks! =)","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26294887","Text":"The class is ape::phylo, I posted a minimal abstract example instead to illustrate the nature of the question independent from the specifics of the class, along with an analogy to an existing R function, <code>setOldClass</code>. The question is generic and not limited to a specific S3 class.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26294613","Text":"stats.stackexchange.com","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26293733","Text":"So where/how do I get this statistical advice?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26293681","Text":"I think you placed an extra <code>,</code> so it should be:<code>mtx &lt;- matrix(NA, 15490 , 15490)</code>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26293312","Text":"Ahh. I see. You were assuming that there might be more than 3 columns. But I think to get it to work with the <code>if</code>, you&#39;d have to do something like <code>cbind(fContents&#91;, 1:2&#93;,\n      if (ncol(fContents) == 3L) {\n        do.call(rbind, strsplit(fContents&#91;, 3&#93;, &quot;&quot;))\n      } else if (ncol(fContents) &gt; 3) {\n        cbind(do.call(rbind, strsplit(fContents&#91;, 3&#93;, &quot;&quot;)),\n              fContents&#91;, 4:ncol(fContents)&#93;)\n      })</code>. Anyway, +1!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26292299","Text":"Thanks a lot! Right what I was looking for! Is there a way to rainbow() color the lines differently to avoid confusion when viewing? Adding behind lines(dat[,1],dat[,2],col = x) outputs repetitive colors (in this case two times blue). col = rainbow(length(..)) did not work either..","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26292205","Text":"thanks @shadow. This is close to what I want. However, I also wanted to have SubjectID matching the order. I was hoping that setting &quot;scales=&#39;free&#39;&quot; in facet_grid allows having independent axes for each plot, but it may not be the case for factors. I am now thinking to convert SubjectID from categorical to continuous variable and see if that would work with facet_grid","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26291979","Text":"you could, but why not just print the value of <code>loadedObj</code> ... ?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26290595","Text":"Why don&#39;t you post exactly what this S3 class is, and why you want an S4 version of it.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26290447","Text":"To check object names in the <code>.Rda</code> file compare <code>ls()</code> before and after, I assume? <code>LS &lt;- ls() ; #Do stuff; ls()&#91;!ls() %in% LS&#93;</code>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26289312","Text":"Yes, sorry it doesn&#39;t address the complexities you revealed, but it get the job done.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26288701","Text":"Is my reading of <code>setOldClass</code> correct; that we can solve the question I pose in the direction S3 -&gt; S4 but not the reverse?  Is ordered subsetting the only reason for this?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26288670","Text":"Thanks for the help.  I agree that rewriting the basic methods like &quot;$&quot; does not sound like a good way to go.  Rewriting every single method for a class is not a solution though - dozens of packages implement 100s of functions for the object, and new ones are still added.  There&#39;s good reason for wanting an S4 version of this popular class, but it cannot happen without backward compatibility.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26288667","Text":"For differences the wrong parse does not matter :)","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26288653","Text":"And you need <code>&quot;%I&quot;</code> with AM/PM, not <code>&quot;%H&quot;</code>. This is also in the documentation. :p","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26288624","Text":"tsk, tsk. You&#39;re encouraging bad behavior.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26288211","Text":"simple workaround. why not. it seems there are several issues. first of all tempfile is not creating a file. I overwrote it using file.create and then faced further issues. It&#39;s not worth the hassle.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26288163","Text":"Thank you. It certainly does the trick. It is not very much  straightforward, nor a documented trick, is it?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26287781","Text":"Thanks @DWin, setTimeLimit seems reasonable. I am waiting for if someone else is having any idea.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26287313","Text":"thanks, I used your example to do some further research and I think I&#39;m almost there, please see my update.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26286651","Text":"That&#39;s what I&#39;ve been missing sooo long, thanks!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26285708","Text":"Ok, that explains the scaling better for me. I had tried something along those lines by adding: + facet_wrap(Class ~ ., scales = &quot;free_x&quot;, space=&quot;free_x&quot;). But this gives me the following error: Error in facet_wrap(Class ~ ., scales = &quot;free_x&quot;, space = &quot;free_x&quot;) : \n  unused argument (space = &quot;free_x&quot;)","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26284699","Text":"Rewritten the answer. I think you&#39;re better off writing your own methods, though.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26283853","Text":"The issue is that R is parsing your string before sending it onto the regex function.  That means the \\ gets read as an instruction by the R parser.  You have to use \\\\ to tell R that the \\ is literal and to pass \\ to the regex.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26283196","Text":"I am aware that I could go about it this way, but this is not what I am looking for.  In particular, I am looking for a solution that does not involve modifying or duplicating the existing S3 methods (Sorry I should have been clearer about this, in my question I say only: by &quot;modifying only the S4 class&quot;).","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26282924","Text":"@arshajii: thank you; I&#39;m not familiar with r so my assumption was that it didn&#39;t support it.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26282866","Text":"Try <code>\\\\d</code> instead.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26282750","Text":"@camelarms: sorry, I guess r regex doesn&#39;t support that shorthand for digits. I will switch it back to <code>&#91;0-9&#93;</code>.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26282678","Text":"Thank you for your addition, that&#39;s what I was trying to do but I got this error: <code>Error: &#39;\\d&#39; is an unrecognized escape in character string starting &quot;&quot;&lt;\\d&quot;</code>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26281322","Text":"That is wonderful and so simple. Thanks.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26281285","Text":"That&#39;s the thing. Thanks a bunch!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26281149","Text":"Very nice. I often overlook the ability to use functions other than the standard &#39;summarize&#39;, &#39;mutate&#39;, etc. with &#39;plyr&#39;.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26280833","Text":"@AnandaMahto, it&#39;s really just a basic <code>cbind</code> statement.  The included <code>if</code> statement is just a succinct way of writing &quot;if your data has more than 3 columns...&quot;","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26280471","Text":"I don&#39;t quite follow what you&#39;re doing with your edit!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26279853","Text":"whoops!  good catch, thanks Ananda.  Edited the answer","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26279671","Text":"Oops, left out the <code>!= 0</code> in the row sums. It&#39;s as @Cnrl explained. Dropping rows with 80% or more zeros is the same as keeping rows with 20% or more nonzeros.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26279489","Text":"This will, of course, create a <code>list</code> for the third column. Perhaps <code>cbind(fileContents, do.call(rbind, strsplit(fileContents&#91;, 3&#93;, &quot;&quot;)))</code> might be more &quot;typical user expectation&quot; (but would also depend on the data being rectangular in order to work).","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26279300","Text":"of course, thanks.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26278364","Text":"@vinod Glad to hear it.  If I&#39;ve answered your question, please mark the check box next to it so that others can see that the question is resolved.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26277992","Text":"Thanks, it worked!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26277878","Text":"+1 %y is just getting the first two digits of the four digit year. %Y should fix.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26274641","Text":"@RabidHealer, we don&#39;t need your exact data, just something similar that recreates the problem you are tying to solve.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26272083","Text":"Hi, sry to be a pain, but would you mind explaining your code? What does dividing <code>rowSums</code> by <code>ncol</code> do?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26271786","Text":"An other error I get is the following : evaluation of function gave a result of wrong length\nCalls: wrapper -&gt; minExpectedValue -&gt; integrate\n\nI use the following sequence xs&lt;-(xmin, xmax,1) where xmin=50 and xmax = 60720.\n\nI don&#39;t understand this error one more time, and especially, why youy didn&#39;t get this error.\n\nI tried to use Vectorize() but it doesn&#39;t work...","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26271073","Text":"Thanks so much!! :-)","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26270837","Text":"I tried this and I get an error :\nevaluation of function gave a result of wrong length\n\nDo you know why ?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26270640","Text":"I would guess it&#39;s plotting in the background and opening a new device for each value of n or then you have opened graphical devices with your plot.new and png calls that exist in your code (I only ran my own independent example due to not having your data). Try running few dev.off()&#39;s to close down any possible png devices or restart your session. If your code has been interrupted due to an error it may be that there are a lot of open devices that were never closed due to code interruption.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26270404","Text":"Thanks a lot ! This time I understand how does your example work. However, I obtain the following error : too many open devices. I don&#39;t plot anything right now just calling lapply !","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26269720","Text":"The start of my post attempts to explain why your h(n) didn&#39;t work - I was posting as you edited. Both n and x cannot be vectors, and I think your code implicitly incorporated a vector for x values. I now edited my answer so that I show how you could test multiple n-values by calling each n value separately with the wrapper function. In essence, it is doing many calls: wrapper(i=1, x=xs, n=nseq[1], fti=fti1); wrapper(i=1, x=xs, n=nseq[2], fti=fti1), etc where nseq is your vector of n values 0:256. For each distribution I would perform this separately, so that I change the i and fti values.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26269162","Text":"@ Ben Bolker: It&#39;s part of my project","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26269031","Text":"And this solution will be much faster than using <code>substring</code> function.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26268761","Text":"Oh nice! Thanks!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26268383","Text":"Thanks so much again!! :-)","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26268087","Text":"Thanks for the answer. I don&#39;t know if you saw my edit, maybe you will understand better. However, I&#39;m still stuck. The idea is to plot h(n) for every 0&lt;=n&lt;=256. It can&#39;t possible to just call h(n) ? I don&#39;t understand precisely the error. \nThe idea of a wrapper is great ;)","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26267884","Text":"just out of curiosity, why?","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26265465","Text":"When I use your solution I get an error saying the subscript is out of bounds. Also I noticed the tables I posted are not showing as they should, the first rows of all 3 tables are shown as headers but they are not, they were meant to be shown with no headers. @Thomas I will try to do as you said to post the data, but I am afraid they are quite big","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26260077","Text":"@nacnudus you&#39;d better remove the <code>figure</code> directory before you run knitr again; there are a lot of dark facts about LaTeX, e.g. it prefers PNG over PDF by default, so if there are a <code>foo.png</code> and a <code>foo.pdf</code>, <code>\\includegraphics{foo}</code> will use <code>foo.png</code>","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26259299","Text":"@ Ben Bolker: You&#39;re  right but I want to do this without any bioC packages.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26259074","Text":"Dear Paul, thanks, very interesting! I wanted to use IDW because it was tested and published in many papers for interpolation of temperature. For example Ninyerola in Spain and many others. According to his study splines were worse. So splines are out and kriging, well I don&#39;t know yet about any study that would compare it with IDW for temperature modelling and I don&#39;t want to do this as it is just a small fraction of bigger study... I know this is rigid but in this case I tend to stick with published solutions :-)","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26258994","Text":"@ agstudy: Thanks","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26258805","Text":"That helps, but it&#39;s not quite there yet.  The first plot is still huge.  The second plot is small, but at a very low resolution.  I tried adding the code from <a href=\"http://stackoverflow.com/questions/13004001\">this similar question</a> straight into the .tex file (after knitting).  That controls the width, but it still falls off the bottom of the slide.  Sorry for <code>print()</code>ing base graphics.  I use Ubuntu - session info coming right up.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26257070","Text":"@Ben- Thanks a lot for clearing my doubt","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26256489","Text":"@RaviRaghava using <code>&#91;</code> is the <code>R</code> idiom, the fastest and simplest to way to do this kind of thing in <code>R</code>. If for some reason your actual use-case can&#39;t use this kind of subsetting, please ask another question with more specific detail.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26255625","Text":"Thanks a lot Mr Hong \nCan you help me doing it same using if loop in R","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26253339","Text":"Ahhhhhhhhhh....Thanks so much. So I will represent my &quot;quarters&quot; data in a format R understands as a date.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26252216","Text":"I think my question was slightly obscured, the solution you gave limit my grids to the whole database&#39;s max and min, but i want the extent to be delimited for data located in each horizontal grid (I&#39;ve just made an edit in my question which makes it clear)!","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26252005","Text":"OK I understand why you want an area chart - the reason it&#39;s not working with your data is because of the way <code>Quarter</code> is coded. For an area chart, my understanding is it will need to be continuous (numeric, date), not categorical.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26251739","Text":"Thanks for your help!! And thanks for the tip on  dput(data). I will use that in future.  I am actually interested in representing the data as geom_area .. as the actual dataset is much larger (815 observations)- and the stacked area chart allows the eye to track left to right better as it follows the ribbon of colour. And when I change geom_bar to geom_area, I get back to the blank grid again.\n\nThanks too for the tip about the Y axis. I dont actually need that limit I guess.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26250645","Text":"Fantastic. Thank you.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26250572","Text":"@ToobaAbbassi-Daloii I edit my answer.","Language":"r"},{"DataSource":"stackoverflow.com","CommentId":"26250277","Text":"@ agstudy: I tried to ask my question briefly. If I want to replace &quot;aaa&quot; with &quot;K&quot;, &quot;aac&quot; with &quot;N&quot; and &quot;aag&quot; with &quot;G&quot;, how I should change the code?","Language":"r"}]