{"DataSource":"stackoverflow.com","CommentId":"26350122","Text":"further is the file &quot;really&quot; unformatted?.","Language":"fortran"}
{"DataSource":"stackoverflow.com","CommentId":"26342070","Text":"Wow, Steve Lionel himself is now on SO!","Language":"fortran"}
{"DataSource":"stackoverflow.com","CommentId":"26316306","Text":"This does not provide an answer to the question. To critique or request clarification from an author, leave a comment below their post - you can always comment on your own posts, and once you have sufficient <a href=\"http://stackoverflow.com/help/whats-reputation\">reputation</a> you will be able to <a href=\"http://stackoverflow.com/help/privileges/comment\">comment on any post</a>.","Language":"fortran"}
{"DataSource":"stackoverflow.com","CommentId":"26315917","Text":"While this link may answer the question, it is better to include the essential parts of the answer here and provide the link for reference.  Link-only answers can become invalid if the linked page changes.","Language":"fortran"}
{"DataSource":"stackoverflow.com","CommentId":"26315638","Text":"Answers which contain only links off-site are frowned upon here.  SO is trying to built a reference book for the ages, all links, like all human vanity, are ephemeral.  You should add at least a brief outline of your solution before a moderator comes along and closes this for its low quality.","Language":"fortran"}
{"DataSource":"stackoverflow.com","CommentId":"26308397","Text":"Change the record length to 8","Language":"fortran"}
{"DataSource":"stackoverflow.com","CommentId":"26293230","Text":"Under their <a href=\"http://docs.oracle.com/cd/E24457_01/html/E21988/gempq.html\" rel=\"nofollow\">system requirements</a> table, Mac OS X 10.5+ is listed as a supported OS. Surely one of the <code>tar</code> files contains a <code>configure</code> file that can be appropriately modified for Mac....","Language":"fortran"}
{"DataSource":"stackoverflow.com","CommentId":"26292976","Text":"The link you posted does not provide any installers for Mac OS X.","Language":"fortran"}
{"DataSource":"stackoverflow.com","CommentId":"26287727","Text":"As Jonathan Dursi pointed out above, your &quot;diff&quot; argument might vary on with the ranks, namely the last one might have a different value than all the others. To deal with this you&#39;d need to make use of the allgatherv routine.","Language":"fortran"}
{"DataSource":"stackoverflow.com","CommentId":"26279528","Text":"1. The missing variables are all declared as globals outside that subroutine. 2. I understant my first mistake, and i changed to allocate(proc_contrib(istart:iend)) 3. Can you please explain me how to fix the Allgather? I need an Allgather because in my real program I need lli as an output. Thanks!","Language":"fortran"}
{"DataSource":"stackoverflow.com","CommentId":"26275899","Text":"In fact, I&#39;d suggest not modifying the routine, but doing the sum outside.&#160; Ideally, you wouldn&#39;t have each processor &quot;know&quot; all the <code>y(i)</code>s; they&#39;d just have their own local piece of the problem, call the <code>log_likelihood</code> routine, and then allreduce the partial sums (or just reduce if the log likelihood is the final result and it just needs to be printed out).","Language":"fortran"}
{"DataSource":"stackoverflow.com","CommentId":"26275815","Text":"You&#39;re writing into <code>proc_contrib(istart:iend)</code> but you&#39;ve allocated it to go from 1:diff; ranks 1 and above will overwrite the end of proc_contrib which probably causes the issue.  (There&#39;s also a bunch of missing variables; numproc, etc).  Further the allgather tries to read outside the bounds of the array.  You can <code>allocate(proc_contrib(istart:iend))</code> and change the call to allgatherv, etc.  Also, you don&#39;t really need to do an allgather; an <a href=\"http://www.mcs.anl.gov/research/projects/mpi/www/www3/MPI_Allreduce.html\" rel=\"nofollow\"><code>MPI_Allreduce</code></a> will do the sum for you which is all you need here.","Language":"fortran"}