{"DataSource":"stackoverflow.com","CommentId":"26360428","Text":"Nobody?  Seems like this should be easier than I&#39;ve made it but I cannot find the answer after much searching.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26334562","Text":"This sounds like something much, much more easily done in software once the data is in memory than to do on SQL Server. Your problem isn&#39;t really amenable to the relational algebra, because of the number of &quot;what if this&quot; sort of ideas and the &quot;if this then thats&quot; in your reply. It just isn&#39;t amenable to SQL, and you&#39;ll have an easier time doing this in other languages.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26333203","Text":"Remember, IQ is column based not row based, so those those lookup_n columns aren&#39;t actually growing as you&#39;re inserting data, unless it&#39;s a new unique value.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26318069","Text":"If you found an answer, please post it below. After a day or so you can accept your own answer, plus get a shiny new SO badge.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26311420","Text":"It&#39;s ok, I was able to make it work using C# Code to do the calculations of what time of day it is. I can post that code if it would be helpful to others.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26308192","Text":"OK Mark, will look at this.  Was told to use it to start with so will check out your link. Cheers.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26302814","Text":"i&#39;m using hibernate code generation, i want to know why this relation is translated to one to many??","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26302430","Text":"Why not use a one-to-one mapping? I have to confess that I&#39;m not familiar with code generating.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26302294","Text":"but in the script above i made the customer_id <code>customer_id</code> INT UNIQUE to avoid it to be translated as a one to many relation-ship","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26302206","Text":"It seems you mapping customer-cards as a set? It&#39;s reasonable that the generated code reflect this mapping.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26301975","Text":"an edit have been made","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26301690","Text":"@Randy the issue is auto schema update. If I had only predeployment and post deployment I have no issue.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26301632","Text":"Could you post hbm?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26301396","Text":"i&#39;m using hbm to generate the entities","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26300123","Text":"Exactly, but that is just the question though and not the real problem, which I will try to further/better explain in near time.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26300071","Text":"I&#39;ll have to check with our ETL guys about adding index&#39;s. We load lots of data (~200 Millions rows per partition) and we use index&#39;s on some of the columns and if we were to add any more it would negatively impact on our loading time. As regards HG or LF, it would have to be LF. There are only about 200 unique values for each of the lookups so HG wouldn&#39;t be suitable.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26296040","Text":"@@Billinkc Yes the data is unicode but i am not specifying connection manager as fixed width. also if i specify code page other than Unicode it is populating the data, but throwing other errors","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26294296","Text":"How do you generate entities, using hbm or schema ddl direclty?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26293187","Text":"and to clarify the reason I&#39;m asking about the indexes...IQ is extremely efficient at doing joins like this when properly indexed, especially if those &quot;lookup_n&quot; columns have a relatively low cardinality.  It doesn&#39;t jump out at me as likely to perform poorly, even with the 12 joins.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26293014","Text":"I know you want us to just write a more efficient query without getting bogged down in other details, and I&#39;m willing, but I think it&#39;s important to cover the Sybase IQ fundamentals first. I would not recommend using a &quot;join&quot; index, as it&#39;s deprecated on newer versions of IQ.  Do you have &quot;HG&quot; or &quot;LF&quot; indexes on all of the &quot;lookup_n&quot; columns of the raw event table? Is lookup_id the primary key of lookup_table, if not, does it at least have an HG index on it?  IQ is extremely efficient at storage space, if they&#39;re not indexed I can&#39;t think of a good reason why you should not add them.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26291887","Text":"@Nathan: Yes. The surprising part is that it still gives me the same error <code>Executed as user: domain\\MYMACHINENAME$ . Msg 18456, Level 14, State 1, Server SOMEOTHERDATABASENAME, Line 1  Login failed for user &#39;linkedserveruser&#39;.  Process Exit Code 0.  The step succeeded.</code> Am I missing something?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26291858","Text":"@sl0ppy: Yes. I did try connecting to it directly and the queries work fine.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26291436","Text":"So if one side is NULL and the other side is NOT NULL, I assume you want these returned, right?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26291292","Text":"possible duplicate of <a href=\"http://stackoverflow.com/questions/205736/get-list-of-all-tables-in-oracle\">Get list of all tables in Oracle?</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290631","Text":"Did you try the other solution suggested in the KB article? That suggests altering the owner of the <i>JOB</i> to a sysadmin login (e.g. &quot;sa&quot;) and is probably a much simpler solution.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290395","Text":"Are you sure that the password hasn&#39;t been changed for linkedserveruser? If that linked server was setup a long time ago, it&#39;s possible that the password has since changed. Maybe you can verify that the username/password is good by connecting directly to the linked server.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290378","Text":"Be sure to do a search before posting. A quick search for: &quot;Sql query get month name from datetime&quot; turns up many promising results, such as: <a href=\"http://stackoverflow.com/questions/5650830/returning-month-name-in-sql-server-query\">Returning month name in sql server query</a> . Obviously include your database type to narrow the results.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290373","Text":"I need to see the line when the product is 0, but I found the error. The dbo.sa.stock can have stock for several warehouses, and when more that one warehouse was filled on the prodcut file, the query showed that extra warehouses lines (CXDVDNORMBL had movements in 3 warehouses), so I added a where statement for the main warehouse. To bad I only found this out after wasting other ppl time... Sry for that.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290348","Text":"You&#39;re getting this because you have three rows in <code>dbo.SA</code> with <code>.REF = &#39;CXDVDNORMBL&#39;</code>. Why do you have them if you want to remove them?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290277","Text":"Do you want to remove <b>any</b> duplicated or just those with zero <code>stock</code>?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290271","Text":"possible duplicate of <a href=\"http://stackoverflow.com/questions/650480/get-month-from-datetime-in-sqlite\">Get month from DATETIME in sqlite</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290255","Text":"And adding <code>AND dbo.sa.stock &gt; 0</code> doesn&#39;t work for you?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290246","Text":"Didn&#39;t know it was possible to exclude table data without also excluding the table schema. Guess I should RTD a bit more and see if some combination of <code>--schema-only</code> and &quot;--data-only&quot; and table exclusions would do the trick.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290208","Text":"You must specify the RDBMS","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290207","Text":"There are two samples in the question, I have since added a desired output and tried to word the question better","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289868","Text":"I just want to use the select * from tab with a user specified","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289825","Text":"Your sqfiddle is incomplete btw (probably because of the ddl char limit).","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289773","Text":"What do you mean by a list of tables?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289238","Text":"if an email address can appear in the field for company_address_city, for example, you have data validation issues which need to be corrected much more urgently than figuring out this query","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289149","Text":"but &quot;steve&quot; and &quot;email@email.com&quot; might appear anywhere (like say, in column <code>personal_address_city</code>)?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288991","Text":"no they can appear in the same column too","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288962","Text":"Is the question <code>How do I find my errors?</code> or <code>How can I step through a query line by line like java or C# in a debugger?</code>?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288896","Text":"I was an escaped character that SQL 2008 management studio was converting.  As a result it failed if you searched for &quot;, but &amp;quot; is what it needed.  Here is the query that worked. select * from xml_file_log where request like &#39;%&amp;quot;%&#39;","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288599","Text":"Thanks for any help","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288499","Text":"@Brilliand, FWIW, you must know the distinct values you want to pivot to columns in any brand of RDBMS, not just MySQL.  Even Oracle and Microsoft, which support a <code>PIVOT</code> keyword, require the columns to be fixed at parse time.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288466","Text":"Why not exclude table data from dump with <code>pg_dump</code> params?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288409","Text":"@danRod - One possible method (the one in the link I just posted) involves grouping by ID, but the method I described above doesn&#39;t involve grouping at all - just 13 separate joins.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288352","Text":"<a href=\"http://stackoverflow.com/questions/1241178/mysql-rows-to-columns#answer-9668036\" title=\"mysql rows to columns%23answer 9668036\">stackoverflow.com/questions/1241178/&hellip;</a> - not the one I remembered seeing, but close enough.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288328","Text":"do you mean using <code>sum(count)</code> and grouping by day?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288299","Text":"I know I saw an answer where it was explained how to do this in MySQL if you know the values for one of the columns... basically you make those known values the column headers, and join the table against itself once for each possible value.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288287","Text":"Just to be sure: &quot;steve&quot; an &quot;email@email.com&quot; might appear in <i>any</i> column ?!? And is it required for the two values to appear in <i>different</i> columns?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288233","Text":"that is called a pivot table... depending on which RDBMS you use, can be quite easy or quite hard","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288228","Text":"Ah, a pivot table.  There are quite a few questions on StackOverflow about this already.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288162","Text":"&quot;a bunch of different items&quot;. How is an &quot;item&quot; represented? ID = Item?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288146","Text":"what database are you using?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287804","Text":"technically, if you&#39;re hideously tight on space, you could use a simple bit field. 0 = downvote, 1 = upvote, null = no vote. But that opens various flavors of canned worms.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287756","Text":"@MarcB thanks great now i know","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287731","Text":"yep, that&#39;s fine. tinyint is an 8bit field type, and has a range of 0-255 (unsigned) and -128 to +127 (signed)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287712","Text":"@MarcB the only values i&#39;ll knowingly INSERT/UPDATE into this field are <code>-1</code>, <code>1</code>, and <code>0</code>. Is that ok?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287597","Text":"You should be more careful when posting examples to SO. You select state name and in the result you suddently have state content, etc...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287573","Text":"int/tinyint/mediumint/bigint will all auto-convert between each other, subject to truncation/data loss if you try to stuff a (say) 32bit value into an 8bit field","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287514","Text":"@MatBailie how to account for up vote, down vote, and not voting? I&#39;m using a <code>TINYINT</code> which hasn&#39;t triggered an error in matching strings or INTs. What should I do instead? This particular data-type issue has been in the back of my mind for awhile...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287497","Text":"Yeah, I&#39;m forgetting something, ugh.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287362","Text":"After further review it looks like the &quot; is actually not a char(34) character.  Now off to see if I can track down what it actually is.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287255","Text":"Have you tried joining the two tables already? Or: What have you tried so far?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287251","Text":"It would be helpful if you included the query you are attempting and the output you are receiving. You may also want to let us know what output you were expecting that you did not receive.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287239","Text":"Why do you have <code>vote=1</code> and <code>vote=&#39;-1&#39;</code>.  Is your data a string or a numeric?  Try sticking to just one data-type in your expressions...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287188","Text":"@MarcB there are 2 items and so only 2 up votes on <code>item_id=1</code>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287145","Text":"How do you get <code>total up votes: 2</code> when there&#39;s 3 votes in the table that are <code>+1</code>?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287032","Text":"I can&#39;t change the table design as I an intern and this is being used by the company for the last 3-4 years","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26286964","Text":"The best way to do this will be to change your table design to something more normalized, like <code>Date, Int, Value</code>...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26286823","Text":"<b>You need to show us the table and index definitions</b>, as well as row counts for each of the tables.  Maybe your tables are defined poorly.  Maybe the indexes aren&#39;t created correctly.  Maybe you don&#39;t have an index on that column you thought you did.   Without seeing the table and index definitions, we can&#39;t tell.  We also need row counts because that can affect query optimization greatly.  If you know how to do an <code>EXPLAIN</code> or get an execution plan, put the results in the question as well.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26286464","Text":"You need flexibility, and you have the skill, then go for a dedicated server.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26286413","Text":"Sorry, but recommendation questions are off-topic here.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26286375","Text":"That doesn&#39;t help anyone understand why 3 and 6 are important.  You&#39;re familiar with the data, nobody else is, so we need samples and and an explanation of desired logic in order to help.  Guessing that&#39;s why you&#39;ve gotten no responses so far.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26286235","Text":"because that is the time in which I will then have to perform a datediff on in another column, basically rows 3 and 6 from the first example &#39;start the clock&#39; so to speak","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26286050","Text":"From your sample, why would you only want 3 and 6?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26286045","Text":"My intention is to - do a what if analysis.\n\nI am trying to do grow sum of rows in A (X2+X3+X6) for each group in A. Now I know total of each group to grow by, and I know I need to update X5 number of records in A, so my total for each group in A can be grown by X4*X6. Since there are more X1s in A than in B, I wanted to randomly select X5 records in A for A.X1 and assign values of X4 to each.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26286041","Text":"<code>o.sueldo + (o.sueldo * 0.11)</code> might be expressed as <code>o.sueldo * 1.11</code>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285968","Text":"SQL Server Management Studio 2010 ? Maybe Visual Studio 2010 or SQL Server 2008 R2.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285616","Text":"For the middle example, what does &quot;nothing has worked&quot; mean? The other two <i>should</i> fail because you&#39;ve borrowed concatenation syntax from other languages (PHP &amp; VB I suppose).","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285565","Text":"My intention is to - do a what if analysis.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285549","Text":"Check this <a href=\"http://stackoverflow.com/a/5822771/125551\">SO Solution</a> for similar question, your are returning only 2 columns from SP and you are setting your <code>l</code> variable to <code>table%rowtype</code> which can have more than 2 columns","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285413","Text":"I tagged your question with &#39;sql-server&#39;","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285277","Text":"@AaronFriel Tried it but doesnt work!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285201","Text":"The &quot;Stored Procedure&quot; part will be the easy bit, it&#39;s what you put inside that we need to solve.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285175","Text":"Just added RDBMS to bottom","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285142","Text":"StartTime -column1\n2013-04-01 12:39:56.000\nEndTime -column2\n2013-04-01 12:44:42.000\nDuration -column3\n286","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285140","Text":"Which RDBMS are you using?  SQL Server, MySQL, etc?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285066","Text":"Can you include input data?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26284977","Text":"You probably just want something like <code>WHERE ADDR4 LIKE &#39;%&#39; + PRIMZIP + &#39;%&#39;</code>?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26284906","Text":"I need help in making SP .But before that i need sql queries also to select the data from tables using one id .","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26284714","Text":"@Nikola Markovinović, thank you!Solved the problem.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26284624","Text":"A stored procedure is just a way to encapsulate your SQL into a single component. Do you need help writing the SQL, or do you have the SQL and just need help putting it into the Stored Procedure? Whichever it is, you should update your question with a little more information that shows your problem.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26284318","Text":"Why? This seems very strange to me and it goes against the concept, the nature of &quot;relational data&quot;. Your use of words like &quot;random&quot; are also very confusing because it sounds like you actually want a precise &quot;number of times&quot; from one cell to another. Can you give us some example input and output, so myself and others can understand what it is exactly that you are trying to accomplish?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26284264","Text":"Select Top 5 Names From tblLearners Where  Gender =&#39;M&#39; Order By Number Desc","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26284214","Text":"Yes, I didnt think it would make a difference? There are names linked to the numbers. I want to retrieve the names but thought my problem was in the Top 5. The complete sql i used was: Select Top 5 Names From t","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26284084","Text":"There can be duplicates from the Card_id, but they must have unique a Time. There are about 34 other columns that I need to keep too.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26284050","Text":"Fine, for Access take a look at <a href=\"http://stackoverflow.com/questions/9339079/how-to-select-top-10-in-access-query\">this answer</a>. In short, include unique field in query.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283969","Text":"Sorry, I&#39;m using Access!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283947","Text":"Are we dealing strictly with <b>duplicates</b> or  can you have three (or more) rows with the same?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283851","Text":"If memory serves, the decryption functions will return NULL if you&#39;re attempting to use the wrong key to decrypt the data. I also seem to recall that you can tell what key encrypted data was encrypted by by comparing the first bytes of the encrypted data with the key thumbprint. I will try to verify.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283825","Text":"this is a question that has been asked before\n<a href=\"http://stackoverflow.com/questions/10084400/how-to-count-the-number-of-columns-in-a-table-using-sql\" title=\"how to count the number of columns in a table using sql\">stackoverflow.com/questions/10084400/&hellip;</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283801","Text":"@PM77-1 +1 was about to post the similar fiddle, seems there is some other issue with that which OP is not able to trace","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283779","Text":"There is no unique id for this data.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283747","Text":"It seems that you are using <code>SQL Server</code> (or possibly <code>MS Access</code>). Here is SQL Fiddle for SQL Server that shows 5 rows with <b>your</b> script: <a href=\"http://sqlfiddle.com/#!3/5d20c/2\" rel=\"nofollow\">sqlfiddle.com/#!3/5d20c/2</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283732","Text":"What db are you using?  I don&#39;t think the statement you gave with &quot;TOP 5&quot; will ever return more than 5 elements, is that part of a larger statement like <code>select * from tbl where Number in (select top 5 number from tbl order by number desc)</code>?  That would make sense.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283685","Text":"and one more thing -- you should specify your DATABASE in your question and tag that as well in question","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283620","Text":"Do you have an <code>id</code> column to identify records uniquely?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283587","Text":"how come you are getting <code>6</code> numbers - I am getting what only that much specified by <code>TOP</code> (even in case of duplicates)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283267","Text":"You are correct about tblMEP_Sites, it should be Sites but this is not the problem here. I am pulling them from sites because I want only the contractsetpointprofiles in that particular site which is the original! I want to copy from Table A to Table A with just the site ID field changed.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283194","Text":"do you have index on Loan_ID?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283142","Text":"The procedure you have above has a lot of problems. In there WHERE you reference a table, tblMEP_Sites, that is not in your join. Also, the fields CollingOccupided, CoolingUnoccupied, and HeatingOccupied are in the table ContractSetpointProfile (I hope), so why are you pulling these same field names from Sites? What is NewSiteID and origSiteID supposed to represent? A field? It appears so in the WHERE, but again, how does tblMEP_Sites.ID relate to the other tables. Do you want to copy from table A to table B? Or from table A to table A with just the site ID field changed? Confusing question.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283095","Text":"NewSiteID is any value in the sites table! lets say it is 25","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283025","Text":"Please explain it in detail. What value you are trying to assign to variable @NewSiteId.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283008","Text":"where are you getting the value for @NewSiteID?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26282538","Text":"Then what should I be doing please?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26282208","Text":"If it is an identity, then you should not be doing this.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26282191","Text":"@MatBailie thank you for a helpful reply can you please drop some more pointers in doing so would be highly helpful","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26282128","Text":"Yes I am using Oracle","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26282048","Text":"I just want to know how would you copy this into the newSiteID (At the end WHERE tblMEP_Sites.ID = @origSiteID)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26282018","Text":"Yes it is an identity ID","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281999","Text":"What database are you using? Oracle?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281865","Text":"MOre info is needed, you are not currenly inserting an ID does that mena the id is an identity?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281778","Text":"Create a .bat or .cmd file on the machine that has SQL Server, the client tools and the .sql file.  Then execute that .bat or .cmd file remotely.  Good luck getting the results back to Computer B in a usable form though.  <i>That&#39;s</i> what client tools are for.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281625","Text":"FWIW, when faced with this kind of problem, I like to construct a pseudo normalized materialized view and then perform the remainder of the query on that, but that might not be optimal.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281602","Text":"@Blam thanks, sql code refers to a code snippet saved with an extension of .sql","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281593","Text":"If there are no tools on Computer B, and <code>sqlcmd</code> doesn&#39;t exist on Computer B, and you can&#39;t install any tools on Computer B, you&#39;ll have to execute <code>sqlcmd</code> <i>from</i> Computer A by either using it&#39;s full network path, or by mapping a drive to it.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281539","Text":"I get that English may be a second language but this in unclear.  What is sql code?   There SQL Server, SSMS, sqlcmd, and SSQL.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281484","Text":"Select the total number of iphone users with 2 or more iphone+android purchases and display this number next to the total number of users.... Can an iphone user even appear in the android_purchases database?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281347","Text":"the requirement is there is a sql code in computer A and I want to run this sql code from Computer B which doesnt have any sql tools in Computer B we need to run the code in A using command prompt.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281338","Text":"Still not following.  Are you saying that Server A has SQL Server installed, Server B does not, and you&#39;re trying to run <code>sqlcmd</code> from... where?  Server B pointing back to Server A?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281183","Text":"I agree. I am a little confused as to what the requirement actually is.  The requirements are that SQL Server client tools should be installed, this will install SQLCMD, on the server you want to run the SQL commands from.  Then all you need to be able to do is connect to the SQL Server.  This may require a firewall exception, depending on your setup.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281166","Text":"using command prompt ie remotely","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281082","Text":"Wait, if the other system doesn&#39;t have SQL Server installed, how do you plan on executing SQL scripts?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281001","Text":"Why not <a href=\"http://www.red-gate.com/products/sql-development/sql-data-generator/\" rel=\"nofollow\">use a tool instead of re-inventing the wheel</a>?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26280815","Text":"thanks it looks useful","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26280747","Text":"Article here : <a href=\"http://mitchelsellers.com/blogs/2008/09/12/creating-random-sql-server-test-data.aspx\" rel=\"nofollow\">mitchelsellers.com/blogs/2008/09/12/&hellip;</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26280594","Text":"@CraigRinger well because I am using rails on postgres (for heroku of course) but I know mysql a lot better.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26280231","Text":"no, they are varchars","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26280215","Text":"Are the fields actually integer values?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26280107","Text":"Why store iphone/android purchases in separate tables?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26280077","Text":"If you are inserting all columns, you can leave off the column name list (not recommended), but you can&#39;t leave off the VALUES keyword","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279773","Text":"It would be very helpful to tell us <a href=\"http://meta.stackoverflow.com/questions/66377/\">what you are trying to accomplish</a>, not just what technique you have decided to use. Especially since your <code>exec</code> will throw the result away and not do anything with it.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279704","Text":"Ahhh thank you!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279688","Text":"your <code>INSERT</code> syntax is wrong. it should be <code>INSERT INTO tableName(col1, col2,..., colX) VALUES(val1,val2,...,valX)</code>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279474","Text":"Why the <a href=\"http://stackoverflow.com/questions/tagged/mysql\">mysql</a> and <a href=\"http://stackoverflow.com/questions/tagged/postgresql\">postgresql</a> tags? Confused as to why I&#39;m suddenly seeing this burst of generic Rails and SQL questions tagged both MySQL and PostgreSQL.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279031","Text":"This isn&#39;t a &quot;gimme the codez&quot; site. What have you tried? What problem do you have? And what &quot;properties file&quot; are you talking about?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279000","Text":"Are all the dates different? What if there are several records with the same <code>inc_date</code>?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278740","Text":"Using NOLOCK everywhere is a habit you do not want to start.  <a href=\"http://blogs.msdn.com/b/davidlean/archive/2009/04/06/sql-server-nolock-hint-other-poor-ideas.aspx\" rel=\"nofollow\">blogs.msdn.com/b/davidlean/archive/2009/04/06/&hellip;</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278717","Text":"How is this related to [sql] when your problem is clearly a PHP problem, and to be more precise, you are NOT including the &#39;Category&#39; class containing file in the Loader.php","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278613","Text":"Any time you mix ORs and ANDs in a WHERE clause you should use parenthesis to clarify your intent.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278485","Text":"@Randy I didn&#39;t want to use a sub-query in the event that there would duplicate inc_date for the same emp_id","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278268","Text":"I am still not clear on this after looking at several places. Is there a difference between &quot;ON DELETE NO ACTION&quot; and my not including anything about DELETE on that line ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278262","Text":"You need to show us code.  Without it we&#39;re shooting in the dark.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278054","Text":"Again: <b><i>there is NO inherent order</i></b> - neither by creation date, nor by the order in which the data was written into the table. Unless you <b>specify an explicit <code>ORDER BY</code></b>, there <b>IS NO ORDER</b>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277391","Text":"What DB engine are you using?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277380","Text":"Please show your whole query, in particular your <code>GROUP BY</code> clause! Also, what DBMS and version--Oracle, MySQL, SQL Server 2008, what?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277357","Text":"@contradictioned Yeah this is what I want.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277321","Text":"@GordonLinoff, I&#39;m using SQL SERVER.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277301","Text":"@marc_s, by &quot;creation date&quot; I mean the order the registry was written in the table, sorry.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277161","Text":"turn your pseudocode into a proper query by creeating the actual SELECT that will return the max date and id, then use that in a JOIN with your table","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277061","Text":"Do you mean checking the value of each column of table A to the column  in table b with the same column name, and all columns must match?  Or do you mean some other type of logic?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277025","Text":"I see.. then maybe you can add this subquery to your join clause instead of making an inline subquery..is that possible in ur code?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277003","Text":"it is datetime column","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276986","Text":"Is <code>admissiondate</code> a <code>datetime</code> column or <code>date</code>?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276960","Text":"i can add a subquery instead of case statement. But not a super query above this... \nAdding a subquery obviously comes with performance hit...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276945","Text":"can you make one script that calls all the other scripts in the proper order?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276937","Text":"@NenadZivkovic Not always the case they can change like RTSPP_BTE_CC1\nRTSPP_BTE_PUN1\nRTSPP_BTE_PUN2","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276883","Text":"@AaronBertrand As of now I have not encountered a case with more than 2 underscores. It might occur in the future in such a case the last underscore till the end of string. A more generic solution which can handle the nth occurrence of underscore would be greatly appreciated","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276867","Text":"I think meta query is usefull for this problem <a href=\"http://codex.wordpress.org/Class_Reference/WP_Query#Custom_Field_Parameters\" rel=\"nofollow\">codex.wordpress.org/Class_Reference/&hellip;</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276858","Text":"99% of that is just building the <code>@colu</code> string which you can do in your development language as it looks like a basic transform based on the current date?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276817","Text":"What is the expected output of your query?  If you are grouping on <code>flag</code>, you would need to aggregate on the other columns.  Do you want the <code>count</code> of <code>location</code> and <code>country</code>, for example?  Or do you want all the data to be returned and just sorted first on <code>flag</code>?  Perhaps you want to order on <code>flag</code> but only print the <code>flag</code> on the first row?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276771","Text":"Is the first part always RTSPP_LZ_ or could have other values?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276737","Text":"Will there always be exactly 2 underscores?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276728","Text":"u cant add a sum but can u change the query? or make this a subquery?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276726","Text":"Can you define &#39;doesn&#39;t work&#39;?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276360","Text":"Hi  Jafar Kofahi you were right, I was mistaken on the type of v_temp_1, what a headache!! Thank you so much :D","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276358","Text":"Is it a double quote <code>&quot;</code> or single quote <code>&#39;</code>. Because I just tested your query and for double quote it works just fine. And what database are you using? SQL Server?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276333","Text":"It works for me with MS SQL 2008R2 where the value in the table is <code>asasas&quot;asas</code>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276259","Text":"what do you intend to do in your where clause <code>FROM USERS WHERE username1 = o_username;</code> you are comparing your in and out parameters? if you have a column name called <code>username1</code> then you should use table alias","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276234","Text":"If I understand you correctly, you want to order your folders like in a tree (depth-first search)? If so, this involves recursion, and that&#39;s nothing SQL is pretty good for.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276156","Text":"What database are you using?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276130","Text":"If you don&#39;t explicitly specify an <code>ORDER BY</code>, then the ordering is <b><i>undefined</i></b> - there <b><i>is NO implicit</i></b> ordering (e.g. by creation date or anything like that ) in a SQL table","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276095","Text":"What are the data types of the various variables?  I&#39;m guessing <code>v_temp</code> is a <code>sys_refcursor</code>.  That implies that <code>v_temp1</code> is some sort of record type.  Does that match the record type that the pipeline table function returns?  Which line does the error message get thrown on?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276082","Text":"I am assuming <code>v_temp</code> is a cursor..but whats the type of <code>v_temp_1</code>? is it <code>tt_v_reshistsincrono%ROWTYPE</code>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276033","Text":"see <a href=\"https://forums.oracle.com/thread/2521125\" rel=\"nofollow\">the first answer to this post</a>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275970","Text":"Is it unicode data? Is your flat file connection manager specified as Fixed Width, ragged right, etc?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275959","Text":"What else is running on the server?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275885","Text":"In addition to being a duplicate, you should at least see my final revised answer on that question.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275579","Text":"I edited it into my original question for easier reading","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275545","Text":"Thanks! But I&#39;m getting another error message now..Error report:\nORA-01403: no data found\nORA-06512: at &quot;L13JAV04.CHECKDUPLICATE&quot;, line 9\nORA-06512: at line 6\n01403. 00000 -  &quot;no data found&quot;\n*Cause:    \n*Action:","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275469","Text":"Jacklin is a string. Should be enclosed in single quotes","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275389","Text":"<a href=\"http://sqlblog.com/blogs/aaron_bertrand/archive/2009/10/08/bad-habits-to-kick-using-old-style-joins.aspx\" rel=\"nofollow\">Bad habits to kick : using old-style JOINs</a> - that old-style <i>comma-separated list of tables</i> style was discontinued with the ANSI-<b>92</b> SQL Standard (more than <b>20 years</b> ago)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275343","Text":"What database are you using?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275073","Text":"Maybe creating a <code>join index</code>? Check this <a href=\"http://infocenter.sybase.com/archive/index.jsp?topic=/com.sybase.infocenter.dc00170.1260/html/iqapg/iqapg335.htm\" rel=\"nofollow\">link</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274825","Text":"Yeah thats one option that is used in other parts of our system and we&#39;ll probably do something similar here. My question is more about, is there any way around the multiple joins on those tables, rather than asking for a way to improve the query with other tricks, if you understand me","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274643","Text":"Wanted to show the total regions per BO.ID so I can attribute the booking share out.  Below works for me!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274535","Text":"is it possible to show the script of your view (with changed table names, if it matters)?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274522","Text":"Are the indices on all of the tables that you derive your view from optimized for your queries and joins?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274273","Text":"Maybe you should add a tag for the <b>LANGUAGE</b> you are using to write a function? Don&#39;t you think that maybe a tag like <code>sql</code> would have been appropriate?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273826","Text":"Never used Sybase, but in Oracle I would consider to put first the range of events into a <code>temporary table</code> and only then do the joins with the <code>lookup_table</code>. Might that be a solution for you?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273564","Text":"What database system you&#39;re using?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273302","Text":"<code>I need to create a column ...</code> - does that mean a calculated column in the database table?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273290","Text":"Show your entire query","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273280","Text":"What DB engine are you using?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273202","Text":"Why are you expecting &quot;2&quot; for those rows?  Do you want to count the total regions per ID on each row?  And which database are you using?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273076","Text":"Simple ... use the &quot;create my code (NOW)&quot; magic button.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26272731","Text":"By reducing I mean, I would like to simplify the SQL query as much as possible including possibly factoring out the duplicate &#39;where&#39; clauses.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26272650","Text":"Answer: Very carefully!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26272603","Text":"You don&#39;t really provide any info about what you tried, idea you&#39;ve got, structure of properties file. Nobody is able to answer that kind of question","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26272545","Text":"This is far too abstract to obtain a decent answer. Please provide a sample schema on <a href=\"http://sqlfiddle.com\" rel=\"nofollow\">sqlfiddle.com</a> and show in your question the expected result of the query when applied on the test schema.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26272114","Text":"You want the sum of all matching rows as a column in your result? What do you mean by &#39;reduce the query&#39; ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26271545","Text":"which database and version of sql ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26271421","Text":"Don&#39;t use images for your expected or actual result. Use the code-button to format it properly. Three advantages: 1. even if the image  on that hoster is deleted this question makes sense 2. we can copy paste it to sql-fiddle to gt sample data 3. we don&#39;t have to click on unknown links","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26294892","Text":"just watch out for the SQL injection vulnerability!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26294871","Text":"if you can give us your <code>filtered</code> condition then it will be very helpful","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26294807","Text":"Any particular programming language you will be using?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26294665","Text":"@Sam: currval is always safe and doesn&#39;t suffer from race conditions - it returns the same value most recently returned by nextval in that session.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26294563","Text":"Yup. Sorry, I was using scraping as a general catch-all word. I have looked into the API.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26292333","Text":"Hi Mahmoud, the system is one called Tourplan, it is a Tourism booking system.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289762","Text":"As you can see from the answers, the order the rows are returned in is unpredictable and non-repeatable. Either the order is not relevant to the COBOL program in question, or the program does not work. If you are looking for a bug, you may have found it. If the program does not require the data to be in any particular sequence, then there is no problem with the code.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289386","Text":"Note: clustering index&#39;s are often used with Mainframe DB2 DB&#39;s, while this does not guarantee an order an order, most rows will be stored in this sequence.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283448","Text":"I am working on a library that can be use to re-build a database from a set of classes on each devs machine (much like entity framework), including the ability to update it. Essentially to clean up table definition.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281142","Text":"possible duplicate of <a href=\"http://stackoverflow.com/questions/17963411/complex-sql-query-with-multiple-tables-and-relations\">Complex SQL query with multiple tables and relations</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278862","Text":"I really don&#39;t see what the problem is with my question, actually I think @MichaelBerkowski answered it, if had written an answer instead of a comment I would have selected it as the best answer.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277178","Text":"My sample was just a break down of the actual problem. I have a table where courses are stored, a table with the user mapping and a table (moodlecourses) where the information is stored which course of the courses table should created in a different system (moodle). In Addition it&#39;s possible to merge two or more courses together for creation in moodle. My goal was to create two views. One for the courses that should created in moodle and one for the user mapping just for this courses. My moodlecourses table has 2 columns: moodlecourseid and courseid of courses table.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275841","Text":"@Krum110487 what is your goal for this? To reclaim space or just clean up the table definition?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274592","Text":"Oracle 11g in RHEL 6.2...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273933","Text":"no. it is not. Mysql is not taking that. <a href=\"http://sqlfiddle.com/#!2/cc793/19\" rel=\"nofollow\">sqlfiddle.com/#!2/cc793/19</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273400","Text":"Why are you aggregating akey? That is already bad enough in a table and in a view you gain absolutely nothing as the view will be calculated at each query.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26271938","Text":"Saying that the query is &quot;not doing what you want&quot; is not much of an information. Please explain what do you want query to do, provide some sample data and the expected results.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270916","Text":"OK:\nso start with <code>Insert the row into table queue</code>\ndo i need to define an array or can i just say <code>Insert* into queue;</code>\n\nhow can i implement the <code>While</code> How do i count the rows? \n\n<code>Select the first row out of queue&#39; is this already done with the while statement or how should i do this?\n\n</code>If children is empty` how can this be done? whit a count?\n\nThank you","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270523","Text":"It would help if there was a bit more sample data (i.e. if <code>rating</code> is meant to be able to have different values, please show some) and the expected results.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270513","Text":"@Damien_The_Unbeliever so can we say mySQL doesn&#39;t follow strictly SQL specification while others do ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270420","Text":"Yes, it&#39;s possible. If you want <i>concrete</i> advice, give us a <i>concrete</i> example of what you&#39;ve tried.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270112","Text":"What should your query return if there are multiple possible groups? E.g. if your &quot;other&quot; contained BROWN with 9% ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270110","Text":"One thing to be aware of is that MySQL conflates <code>NULL</code> and <code>UNKNOWN</code>, whereas most other database products keeps them as separate concepts.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269775","Text":"Here&#39;s some info: &lt;<a href=\"http://oracle101.blogspot.com/2008/08/oracle-collect-function.html&gt\" rel=\"nofollow\">oracle101.blogspot.com/2008/08/oracle-collect-function.html&gt</a>;","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269753","Text":"There isn&#39;t really a good reference <a href=\"http://dev.mysql.com/doc/refman/5.0/en/working-with-null.html\" rel=\"nofollow\">besides the MySQL documentation</a>. If you have a specific query with which you have difficulty, post it and we can help.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269707","Text":"MySQL implements 3 valued logic just as the standard describes.  Use <code>value IS NULL</code> to compare <code>value</code> with <code>NULL</code>.  You cannot use <code>value = NULL</code>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269661","Text":"Without knowing what your current indexes are and the database you are using and the query plan for your query, any hints on performance are just guesses.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269491","Text":"@PraveenPrasannan : sorry, my mistake. but now its ok","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269105","Text":"<i>‘I also need to ignore any rows where the balance is zero’</i> – you mean you need to ignore users whose <b>last</b> <code>balance</code> is zero?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268801","Text":"Ahh ok. How do I go about casting it? I tried but not getting any luck.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268717","Text":"In fact <code>yyyyMMdd</code> is in some ways a better format than the others, as it&#39;s naturally sorted... but yes, you should use the appropriate data type to start with.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268636","Text":"That should teach you to never store dates in VARCHAR columns.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268490","Text":"You&#39;re probably correct.  COLLECT requires a custom type and a CAST to a standard datatype.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268444","Text":"This is Teradata","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268218","Text":"this is oracle or mysql ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268118","Text":"Added how my queries would be if i would&#39;nt use collections","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268024","Text":". . I doubt it.  Tables are inherently unordered.  DB2 (to the best of my knowledge) doesn&#39;t offer a way to express a default sort order, and I doubt that COBOL would override this.  It is possible, in some databases, that if <code>X</code> is a view with an <code>order by</code>, then the rows would be returned in that order (possible, but not required by the standard).","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267977","Text":"If you do not rely on models and resource model, using direct sql queries may not be a real problem and may save your time.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267848","Text":"no it is just a statement for Oracle...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267833","Text":"What RDBMS are you using? MySql? Postgres? Oracle? Functions for current date can differ in each of them.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267825","Text":"Is this being done in PHP?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267655","Text":"why record with uid = 1 not in result set?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267581","Text":"I&#39;m not going to be of much help here, but what do your queries look like?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267563","Text":"What are you <b>table structures</b> (columns, datatypes)? And which indices do you have on those tables? How many rows of data are in those tables?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267392","Text":"@MartinSmith, That is exactly what I wanted. Its a pity MSSQL doesn&#39;t allow it.\n&quot;SELECT * \nFROM EXAMPLE\nWHERE (ColA,ColB,ColC) = (&#39;val0&#39;, &#39;val1&#39;,&#39;val2&#39;)&quot;","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267208","Text":"@PabloFranciscoP&#233;rezHidalgo <a href=\"http://sqlfiddle.com/#!2/d6b7c/1\" rel=\"nofollow\">SQL Fiddle</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267085","Text":"Please, Martin, could you give me an example of that?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266908","Text":"What you do is the following: You look at the first row only (with your FETCH .. INTO) then you update all rows. I doubt thats intended...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266901","Text":"Some RDBMSs allow you to compare tuples but SQL Server doesn&#39;t.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266826","Text":"Yeah, I thought about doing that, but it seems relatively straightforward with the query below.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266760","Text":"I&#39;m lazy so I would denormalise the auction table and keep a reference to the highest bidder. That way it&#39;s a simple join :)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266551","Text":"Please could you edit your post to include code blocks which show the two SQL queries you tried. Also, it might be worth stating what DBMS you&#39;re using.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266432","Text":"you would still have to specify the set / ordering of column names to match? in which case it couldn&#39;t be much more concise than the query with multiple AND&#39;s?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266375","Text":"It&#39;s not a problem to get the other information - I just need the counts.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266132","Text":"Just an idea - i might be wrong - you need to define the specifications: - for all item_sales get highest bidder and add the info need for the bidder like count of all bids. Hope this helps","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265836","Text":"Found the issue!\n\nHad to use single quotes instead of double quotes when calling the function!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265701","Text":"@Sylvain Leroux I need to update my databse","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265684","Text":"I don&#39;t think that is possible. I would advice you to try and start using SQL queries to do your updates instead of <code>edit top 200 rows</code> option. You will have more control over what and when is committed.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265587","Text":"What have you tried? Do you expect us to do all the work? How much will you pay us?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265586","Text":"Do you want to <code>UPDATE</code> the name as stored in the table, or extract (<code>SELECT</code>) the data with the name somehow altered?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265581","Text":"don&#39;t know the solution, but i would be very careful updating all rows as you are doing with the statement (I am assuming this isn&#39;t the intention): update gender set sex=&#39;female&#39;. And by the way don&#39;t use sms language","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265510","Text":"you can refer this link <a href=\"http://stackoverflow.com/questions/1470792/how-to-calculate-the-ip-range-when-the-ip-address-and-the-netmask-is-given\" title=\"how to calculate the ip range when the ip address and the netmask is given\">stackoverflow.com/questions/1470792/&hellip;</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265313","Text":"@parado PLS-00306 wrong numbers or types of arguments in call to &#39;=&#39; PLS-00324 cursor attribute may not be applied to non-cursor &#39;v_gen&#39;","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265219","Text":"What is the error?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265127","Text":"Not sure what exactly you mean? How do you determine the unique values? Do you need to group the similar names, then pull out the one with the latest date?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264996","Text":"Unless you have race conditions, why not fetch the last Id from the sequence. Sequence.CURRVAL if I&#39;m not mistaking. Either that or fetch the biggest Id in the table (auto-increment, so biggest = last Id inserted).","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264750","Text":"What are you trying to get as a result? If you <code>group by RoleName</code>, you will get one row for each role - and one role can possibly contain many users - so selecting <code>userName</code> with it is invalid.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264655","Text":"And what have you tried yet?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264636","Text":"you need to get record with previous date ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264520","Text":"what is the DBMS?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264315","Text":"@user2632133 Please read through <a href=\"http://meta.stackoverflow.com/questions/5234/how-does-accepting-an-answer-work\">&quot;How does accepting an answer work&quot;</a> You&#39;ve now got lots of good answers on your questions.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264256","Text":"@schurik yes, sorry I forgot to mention that","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26263537","Text":"normalization anyone?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26263502","Text":"Yes I agree it shouldn&#39;t be there, removed it thanks. Now the error changed to <code>ORA-00936: missing expression</code>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26263480","Text":"how ho you pupulate the item.id and item_history.id columns? are there sequences defined?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26263388","Text":"Why do you have <code>order_id</code> in the <code>select</code> list; what are you expecting to show there for a single row that sums up 10 orders? You either need to remove that, or replace it with an aggregate function.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26263274","Text":"So you want to order by number of subjects separated by comma?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26262909","Text":"Which RDBMS? MySQL? SQL Server?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26262704","Text":"Take a look at PredicateBuilder : <a href=\"http://www.albahari.com/nutshell/predicatebuilder.aspx\" rel=\"nofollow\">albahari.com/nutshell/predicatebuilder.aspx</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26262543","Text":"When you list the tables in the FROM clause like this <code>FROM book, author, ownersbook</code>, they are <code>CROSS JOIN</code>ed, thats why you are getting duplicates. You have to write the JOIN condition in the WHERE clause instead of the ON clause. Otherwise, use the JOIN syntax using the INNER JOIN or any other join type with ON clause to write the conditions","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26261449","Text":"As far as I know, there is no standard way to escape reserved words across DB vendors.  You could change your column names?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26261022","Text":"Not sure but I shouldnt be using any functions such as array agg etc as I am not familiar with the functions. Any way to do this with basic sql ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26260791","Text":"question is really large. What have you implemented for now ? read file ? parse of xml content ? ContentProvider for database operations ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26260393","Text":"Which version of PostgreSQL?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26259992","Text":"@Parado I thought I have to <code>select</code> all the rows that contains <code>pear</code> by using <code>like</code>, and <code>loop</code>, <code>replace</code> the selection, and <code>update</code>. But @danihp has much cleaner way to do it.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26259632","Text":"Cleaner way than update statement? Can you include your <code>update</code>?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26259560","Text":"<code>create database ora10;</code>? I think you may be incorrectly reading the rest as output though, the logfile and following rows are supposed to be a part of the command (up to the semicolon).","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26258649","Text":"You&#39;re talking about SQL Management Studio, not SQL Server... you should write your own application if you want to customize procedures&#39; list view.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26258413","Text":"Anyway solved, using different concept.\n\nNot posting here, coz, it will be not so much relevant to my question, but for my actual problem, its working as charm.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257992","Text":"Remove the most outer ( ). Add <code>PCM_ID, Cost_type, Supplement_type</code> to after SELECT and:  <code>GROUP BY PCM_ID, Cost_type, Supplement_type</code> at the end.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257714","Text":"My SQL skills are also very limited. Having said that, what you wrote looks good ... what exactly is going wrong? Is the value being returned not correct?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257623","Text":"Do you mean update or just select? Please post the desired output for the sample data. Also what RDBMS you are using.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257584","Text":"Show sample data and desired results. I&#39;ve read your word problem three times and I&#39;m still not clear on what you&#39;re trying to do or how the query you&#39;ve shown doesn&#39;t help with that.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257530","Text":"what is your question?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257431","Text":"No. Use a stored procedure for this (or fix the design).","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257324","Text":"can you add some sample data to the question?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257204","Text":"If you have multiple tables that have the same structure (which would also be a requirement given your indicated query, since the structure of a function&#39;s return type must also be fixed), it&#39;s usually an indication that the tables should be merged and an additional column be introduced to hold the information that&#39;s currently being held in those table&#39;s <i>name</i>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257059","Text":"No, you cannot parameterize table or column names in a static query. And you cannot use dynamic SQL in a function.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256967","Text":"sir  i have provided my tables ..so that now u can guide me properly","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256702","Text":"Peterm and himanshu must be verging on psychic because I have absolutely no idea what you&#39;re talking about.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256428","Text":"I am doing it on postgres using SQL.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256417","Text":"A player can play for multiple teams. I want players who play for same exact teams. Lets say player A plays for Bulls, Magics, Celtics and player B plays for bulls, magics, celtics, heat. They don&#39;t count because heat is not a team player A plays for. I want to find two distnct players who play for exactly same teams, nothing less nothing more. Also if two players currently don&#39;t play for any teams which is possible. They should be in the output. Another thing, let&#39;s say team A and team B  match. The output should either be A, B or B, A and not both. If any more questions do let me know.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256350","Text":"What DBMS are you using?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256318","Text":"I understand that you want to find 2 players playing on the exact same teams.\nCan you clarify what you meant with &quot;no repetition&quot;?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256299","Text":"You are probably experiencing what is called &quot;parameter sniffing&quot;. Check this link - <a href=\"https://www.simple-talk.com/sql/t-sql-programming/parameter-sniffing/\" rel=\"nofollow\">simple-talk.com/sql/t-sql-programming/parameter-sniffing</a> and try &#39;option2&#39; to solve your problem.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256087","Text":"I want SQL SERVER Answer","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26255876","Text":"pls provide some sample data","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26255793","Text":"ca you provide an example on www.sqlfiddle.com of your tables?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26255683","Text":"1.You should probably post your code. 2.Do you use indexes and if yes do you use them correctly? 3.You may need define separate transactions for each piece of code within the Stored Procedure. 4.You should post your code....","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26255578","Text":"I suspect the inner query gives you the increasing numbers you want. What is the output of the inner query?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26255551","Text":"Do you want an SQL-Server answer or a MYSQL answer?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26255366","Text":"@Himanshu it is for e-mail accounts. I wanna make the usernames to email account for users. for example\nusers/786691/himanshu &gt; himanshu@stackoverflow.com\n                                    \nusers/555585655675/himanshu &gt; himanshu.2@stackoverflow.com","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26255194","Text":"Why are you updating the name to name.count. Why can&#39;t you have this information in a view that shows the count for a name?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26255107","Text":"@BobiAria: You have to improve your question, this way noone really understands it","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254980","Text":"@user2636610: code may be generated, but it can be improved, don&#39;t you think","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254757","Text":"hi @user2636610 , this is good if u can provide sample data =)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254556","Text":"what&#39;s stopping you?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254555","Text":"support @marc_s =)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254531","Text":"I forget to tell something \nA Blog will have multiple images and visa verse\nThat is a single image can also be used in multiple blogs...\nThen how will I set the relations?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254526","Text":"Interesting to know Mark, but as I mentioned the basic code is generated by the BI package through a drag/drop of tables/fields/joins...so it&#39;s not really a habit","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254332","Text":"@Bobi Aria : Use dynamic SQL.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254018","Text":"Try with an outer join, it will use &#39;null&#39; as your default value.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253974","Text":"<a href=\"http://sqlblog.com/blogs/aaron_bertrand/archive/2009/10/08/bad-habits-to-kick-using-old-style-joins.aspx\" rel=\"nofollow\">Bad habits to kick : using old-style JOINs</a> - that old-style <i>comma-separated list of tables</i> style was discontinued with the ANSI-<b>92</b> SQL Standard (more than <b>20 years</b> ago)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253952","Text":"I need help to resolve this. The professor is an impatient man","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253550","Text":"I used in my actual, added here too.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253507","Text":"Can you also provide a sample query that you wrote?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253487","Text":"You need to use <code>limit clause</code> for better paging.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253479","Text":"My mistake, forgot to mention, updated question check now.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253456","Text":"this is either very good joke or very strange DB administrator","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253416","Text":"How is this giving rownumbers?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253397","Text":"can you provide some sample result?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253177","Text":"why do you have symbols as your procedure names?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253027","Text":"Rather than scraping, wouldn&#39;t you be better off using the api (<a href=\"http://www.mediawiki.org/wiki/API:Main_page\" rel=\"nofollow\">mediawiki.org/wiki/API:Main_page</a>). See also... <a href=\"http://stackoverflow.com/questions/627594/is-there-a-wikipedia-api\" title=\"is there a wikipedia api\">stackoverflow.com/questions/627594/is-there-a-wikipedia-api</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252632","Text":"frankly, because I didn&#39;t think of it :-), also I want to retain data if possible, I have a &quot;reset&quot; flag if the dev wants to completely drop the table, or if they simply want to &quot;update&quot; it.\n\nI am still toying around and finalizing everything. I will keep this in mind though!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252462","Text":"@brian it may be a lot of data, and there may be many foreign keys pointing at the column being kept.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252164","Text":"Just curious, why not push the valid columns into a new table, then drop the old table and rename the new?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251995","Text":"I am using postgres and created a small database to test but I don&#39;t think to solve this problem we need a databse. Sorry, not so great with terminology. Just started learning SQL.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251978","Text":"Which database server? A version may also be relevant","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251962","Text":"Sorry, I have a local database i am using but I don&#39;t know how to put it here.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251949","Text":"which database are we working with?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251913","Text":"@HABO as it turns out, there <i>is</i> a string format in there (note the <code>&#39;&#39;</code>), and the 114 doesn&#39;t seem to have anything to do with the problem.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251857","Text":"user input capturing is work of front end application","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251764","Text":"the tables are huge like &gt;500,000 rows. \n\nmatch has probably a number of columns, about 8. and for match user it has about 15 columns.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251619","Text":"what are you asking..?? This question is not clear.? what is this.. <code>i have 2 for each element, i have 2 casa, 2 apartment, 2 roor</code> be specific and technical while you ask the question.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251592","Text":"What database are you using?  This is tagged both MySQL and Oracle.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251569","Text":"How large are the tables?  What database are you using?  What indexes do you have on the table?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251253","Text":"@Gordon who knows, people down-vote for all kinds of reasons, but there are plenty of potential reasons someone would have down-voted this post, particularly in its original form.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251166","Text":"+1 . . . If both Aaron and I find the question interesting enough to answer, then it is not worth a downvote.  And, you did include code to generate the tables that you want for the question.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251154","Text":"Unfortunately most people work with a single platform or a very limited subset, and working with a platform means you must ditch the classroom and deal with real-world implementation details, so I&#39;m not sure there&#39;s a very large population that could even provide such consensus, never mind have any practical use for it. I&#39;m well aware that there are many database-agnostic questions/answers on SO, that doesn&#39;t mean they&#39;re all good questions with good answers, or weren&#39;t asked before such questions were more accepted in general (the site&#39;s standards have changed a lot).","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251133","Text":"@AaronBertrand, the specification is virtually unreadable, by humans anyway :) As for vendor-specific answers, I believe in designing against an interface instead of implementation details whenever possible. At the very least, I&#39;m looking for some sort of industry consensus. On a side-note, there are plenty of database-agnostic questions/answers on Stackoverflow.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251049","Text":"I stand corrected!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250995","Text":"How can it be database agnostic when different platforms can have different implementations? If you just want a quote from the standard, why don&#39;t you read the standard? If you want serious answers here you should probably focus on vendor-specific implementations instead of expecting a &quot;this is how it works on all database platforms&quot; answer...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250972","Text":"Netezza doesn&#39;t enforce unique index.  I don&#39;t know if it&#39;s just our configuration or if it&#39;s the whole system.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250933","Text":"Why not add a unique index on <code>(HH, RN)</code> and retry on failure?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26390034","Text":"Accept connection in the constructor and pass it while instantiating. Methods of the class can use it as instance variable.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26384156","Text":"Makes sense, thanks for the info.  Is there a way to reuse the connection without passing the sql connection info to every method I call from another service?  Seems like there should be a better way.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26379874","Text":"For single thread app (unless very long running process), I don&#39;t see need of connection pool. Transactions work at connection level and Pool just returns you a connection from a bunch of pooled connections instead of creating new connection every time, and that doesn&#39;t affect transactions. ${var} will make the query vulnerable to sql injection and other syntactical issues, prepared statements save you from that trouble.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26379650","Text":"Right, definitely single-threaded.  I&#39;m concerned about rollback and such when something errors out.  I&#39;ve researched the transactional parameter, does that also work with connection pooling so I wouldn&#39;t have to worry about it?  Per your suggestion to use prepared statements, is there a reason you suggest it?  Thanks!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26376800","Text":"oh wow, that was a trivial mistake on my part, that was bugging me forever, thanks!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26376591","Text":"@timpeterson - I used NULL and you used 0.  NULL is never the result of MIN or MAX unless all values are NULL or there are no values at all.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26369353","Text":"your first code block and sqlfiddle do work but I&#39;m having trouble seeing why it is different from the code I wrote. They look the same to me that&#39;s why I said I didn&#39;t think it was correct. Thoughts?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26364942","Text":"@coder: no, you don&#39;t need this for the insert to product_purchase_item (if your intent is to insert a new row.) You&#39;d only use this if you wanted to do an &quot;UPDATE OR INSERT&quot; type operation, depending on whether the INSERT operation would violate a unique key constraint. (Note that in the case of an UPDATE action, an AFTER INSERT trigger will not be fired.)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26364796","Text":"@coder: the <code>INSERT ... ON DUPLICATE KEY UPDATE</code> is a single statement that will perform an insert, but if a &quot;duplicate key&quot; exception is raised (i.e. a value already exists in a unique index), then the UPDATE action will be performed. My SQL Fiddle demo (ref&#39;d  in comment above) shows a trigger that does eseentially the same thing the body of your trigger is doing: checking if a row already exists, and then performing an update or an insert.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26356233","Text":"yea @spencer7593 both tables first column has AUTO_INCREMENT and PRIMARY KEY. Thanks for observations. My mistake was I didn&#39;t know that value return null when IF condition THEN is false. Perhaps, DUPLICATE KEY UPDATE is the best way. But when I insert new value in product_purchase_item table, is there need DUPLICATE KEY UPDATE","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26336062","Text":"Check your table name in <code>OBJECT_ID(...)</code>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26330330","Text":"@spencer7593 Yes, you are right! I did not even notice the first column the OP called <code>product_stock_id</code> in his post text before. So, the verdict is: <i>if</i> there IS an &quot;invisible&quot; <code>AUTO_INCREMENT</code> column (not mentioned in the <code>INSERT..ON DUPLICATE</code> statement) this <i>column value will be incremented</i> everytime the update part of the statement is executed! You (or rather I ;-)) learn something new everyday! Thanks for this excursion!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26328129","Text":"I have tested, and confirmed that there is an issue with &quot;gaps&quot; in AUTO_INCREMENT caused by the <code>INSERT ... ON DUPLICATE KEY</code> which occurs in MySQL 5.1.53 using InnoDB. Here is a demonstration of the same behavior in 5.1.61 <a href=\"http://sqlfiddle.com/#!8/509ef/1\" rel=\"nofollow\">SQL Fiddle here: http://sqlfiddle.com/#!8/509ef/1</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26327717","Text":"The <code>INSERT</code> statement in the OP trigger has <i>three</i> columns (according to the list of values in the insert), with a <code>NULL</code> supplied for that first (unnamed) column. It was this (unnamed) column I assumed had <code>AUTO_INCREMENT</code>. There&#39;s no indication, in the OP trigger code that the second column, named <code>product_id</code>, is AUTO_INCREMENT. The <code>INSERT ... ON DUPLICATE KEY</code> approach requires a UNIQUE constraint on <code>product_stock(product_id)</code>. The missing AUTO_INCREMENT values I was concerned with would be on this (unnamed) column, not the <code>product_id</code> column that I mistakenly identified. I will test.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26326177","Text":"(... ran out of characters before) An INSERT..ON Duplicate (when new_id=3) lead to record 3 being UPDATED and the next &#39;regular&#39; insert happened at id=11. So, as far as I can make out, everything seems to be fine.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26325428","Text":"@spencer7593 Interesting remark! I just put together a little SQLfiddle <a href=\"http://sqlfiddle.com/#!2/c99a3/1\" rel=\"nofollow\">link</a> to investigate further. It seems to me that the undesired effect is not there. In my sample I have a list of products ranging up to id=8, then I left a gap and inserted another product at id=10. Now, the next auto_increment position is going to be 11. When the Insert..On..DUPLICATE statement comes in with id=9 it fills the gap the next &quot;normal&quot; insert still picks id=11 as the next free id.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26325320","Text":"To my system, our ADD and DELETE operation take the same object, so it&#39;s not a matter of us converting the objects. Thanks for all your advice.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26325196","Text":"That&#39;s a good point. Better to put them in one queue so they get operated on in order. Otherwise you&#39;re right you&#39;d have to reconcile the operations.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26325006","Text":"I agree with that, but my concern was if you get someone to do an add, then a delete of the same element, how do you address the potential that the queue&#39;s could get read out of order?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26324424","Text":"Real confession time: I left the job before we implemented delete. Ha. It was a really rare case, but yeah I would have implemented a separate queue to handle deletes. I liked to keep the queues separate and distinct. It became hard to try and use one queue for multiple purposes.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26324166","Text":"If someone deleted an article, was that delete a separate queue, or did you use one queue and it had a field for operation(ADD, DELETE) or did you have one queue for adds, one for deletes?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26323571","Text":"Just to be aware, one side effect of this approach is that an execution of this statement will &quot;use&quot; a value from the AUTO_INCREMENT   column, even when an UPDATE is performed. This isn&#39;t a problem, but it is something to be aware of, because the next question will likely be, &quot;<i>why are there gaps in my product_id?</i>&quot;","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26323469","Text":"We put date fields at the record level in SQL. CreateDate, UpdateDate. Then you can run your diffs against those and ship what has changed/what is new. At the application level we&#39;d write an object to SQL and then serialize it as JSON and send it via JMS. For all writes to NoSQL we did upserts. This avoided the issue of having to know what was newer. Example: Someone writes a new article in the CMS. We write it to SQL and also send a JMS message with the object serialized as JSON. The NoSQL write would upsert (write new if not there, update if exists). Does that help?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26323429","Text":"@focusHard - I honestly don&#39;t know.  <code>tab</code> was ancient back in the 7.3.4 days and that was 15+ years ago.  I wasn&#39;t around a couple decades ago when Oracle 6 was still around.  Either there was some other table or you just logged in to the schema in question and queried <code>tab</code>.  If you are really curious, there are some folks over in the OTN forums that have been using Oracle for a few decades who might have recollections of the olden days.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26323178","Text":"thanks. Just curious about how do people specify user in ancient times.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26322984","Text":"You mentioned date fields, did you do this at the message and NoSQL entity level? Did you do a stateful update(append) or a stateless update(entire state in JMS message)? For your date fields, did just ignore any of the &quot;older&quot; JMS messages if your NoSQL entity was newer? I&#39;m using Web Services for my CRUD, did you have similar concept in the queue&#39;s for doing CRUD?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26319260","Text":"better in the sense I feel the <code>CASE</code>, two <code>CAST</code> operations and adding the <code>DATE</code> column might be not be required. getting rid of some of them could make the code faster and efficient as there are close to 2,700,000 rows. <code>INTERVALCOUNT</code> as of now has only two values 24 and 96. Thanks for the more generic solution and for getting rid of case","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26318615","Text":"When I run it I get &quot;query executed successfully&quot; with no output.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26318182","Text":"Yes, it is for a report","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26315271","Text":"Any more efficient way than above?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26307036","Text":"@ManthreePeiris . . . Done.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26299866","Text":"Yeah that looks possible. I&#39;ll try that and see how it works. Thanks","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26298739","Text":"@ManthreePeiris No problem :)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26298687","Text":"My requirement was to remove the decimal point. Sorry may be its confusing at your end","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26297655","Text":"Gordon, Please update your answer for others benefit.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26297585","Text":"@ManthreePeiris Do you want to to remove a dot and space?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26297560","Text":"Thanks Parado, Here also needs to use <code>NULL </code> instead for <code>&#39;&#39; </code> for me. Otherwise it will give space there","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26297231","Text":"@timpeterson - In what way doesn&#39;t the first code block work?   <a href=\"http://www.sqlfiddle.com/#!2/f6064/4\" rel=\"nofollow\">sqlfiddle.com/#!2/f6064/4</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26296960","Text":"Many thanks for the response","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26294381","Text":"oops,sorry for that","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26294235","Text":"It did work with this, <code>stuff(convert(varchar(255), ChrgAmt), charindex(&#39;.&#39;, convert(varchar(255), ChrgAmt)), 1, NULL) </code>. Appreciate your help.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26294118","Text":"In fact it returns <code>blank </code> for my input data for ChrgAmt i.e. <code>270.00 </code>. The data is initially in <code>numeric(9,2) </code>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26293920","Text":"nice and fast!!!!!!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26293883","Text":"Thanks for your update. Even without <code>255 </code> it does give the same results. As I mentioned I am on <code>Sybase </code>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26291442","Text":"Thnks!, very close, jeje.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26291398","Text":"you welcome ! for performance i think this should work nice.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26291373","Text":"Thanks! Any reason I should worry about perf for using a conditional operation here? This will be run on a large data set (input size of 8-10 GB). But this works great so far, thanks again!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26291206","Text":"+1 for tech support. Good luck to all.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26291089","Text":"Ya that did work. But i need it in different columns.because i cannot merge those in a single column.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290973","Text":"select * from all_tables where owner = &#39;your user&#39;","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290358","Text":"@RajathAradhya. If you feel this answered your question, don&#39;t forget to accept it.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290057","Text":"@RajathAradhya. see this <a href=\"http://sqlfiddle.com/#!4/b0f00/1\" rel=\"nofollow\">sqlfiddle</a> I think the problem was the double quotes. I updated my answer with the new query. This one should work","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290031","Text":"I tried select * from tab where user=&#39;username&#39;; I know there are many records for the username I tried.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289960","Text":"what did you try that gave you no rows?  maybe you had it right and there simply were not any records.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289950","Text":"@filipe silva ORA-00904: &quot;CLUB&quot;: invalid identifier.club is a table name..so how can i use like that??","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289940","Text":"thanks for the recommendation, I&#39;ll definitely check his book out.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289912","Text":"I have tinkered with it for a while using where. Sometimes I get error message, others no row selected. I just want to know the specific syntax I should use.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289855","Text":"@RajathAradhya. Ah. At first there was a typo with an extra &#39;,&#39; character, but i removed it. So it is doing what you wanted?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289829","Text":"@filipe silva no it is not.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289794","Text":"@filipe silva  you understood my question but i am getting error in your code","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289740","Text":"@RajathAradhya. Isn&#39;t the query working for you?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289720","Text":"Forget the syntax error i want code for my question","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289575","Text":"<code>select a, b, from c</code> is not valid syntax @Rajath; change it to <code>select a, b from c</code>. There&#39;s one less comma.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289557","Text":"@ben i din&#39;t get u","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289555","Text":"I re read the question and i&#39;m not sure he means that kind of duplicates. He doesn&#39;t want the combination. But you are right if there are customers and clubs with the same name and phone number, they will get returned. @RajathAradhya. Like it is now works for you?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289510","Text":"Your edit means this will no longer get rid of duplicates...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289487","Text":"There&#39;s trailing commas @RajathAradhya; your client will direct you to the line and column that the problem occurs in that error message.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26289468","Text":"getting a error ORA-00936: missing expression","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26288898","Text":"For those coming across this answer, the first code block doesn&#39;t appear to be correct but the 2nd one definitely is. Also the answer by @491243 works too, its just MatBailie was more thorough.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287442","Text":"@MatBailie why is a subquery worse than a <code>JOIN</code>?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287295","Text":"You don&#39;t need a correlated sub-query draining performance.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26286408","Text":"you&#39;re right, I created two types for codigo and fecha and worked fine. Thank you","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26286206","Text":"If you want to assign NewSiteId value to CoolingOccupied column then in that case please look at following- Select NewSiteID, CoolingUnoccupied, HeatingOccupied FROM \n Sites JOIN ContractSetpointProfile\n ON ontractSetpointProfile.ID = Sites.ContractSetpointProfileID\n WHERE tblMEP_Sites.ID = origSiteID","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285796","Text":"this is incorrect because you cannot assignn NewSiteId to CoolingOccupied","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285723","Text":"No, <code>CONCAT</code> is only available in SQL Server 2012.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285654","Text":"@Gordon even here the default might not be ok if either column contains &gt; 30 characters...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285637","Text":"@Parado . . . You should always include lengths when you specify <code>varchar</code>.  Although the default is ok for <code>cast</code> and <code>convert</code>, the default is different (and troublesome) in other contexts.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285632","Text":"Please, <a href=\"http://sqlblog.com/blogs/aaron_bertrand/archive/2009/10/09/bad-habits-to-kick-declaring-varchar-without-length.aspx\" rel=\"nofollow\">no varchar without length</a>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285143","Text":"@Nexus . . . This will work for any number of columns.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285127","Text":"Boolean logic in SQL is three valued: TRUE, FALSE and NULL. A comparison (&lt;, &lt;=, =, &gt;=, &gt;, &lt;&gt;, !=) when one of the values is NULL will return NULL. An <code>IF condition THEN</code> will execute the <code>THEN</code> block ONLY if <code>condition</code> returns TRUE.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285120","Text":"Will this work if I have more columns as well?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26285100","Text":"Thanks Gordon I&#39;ll talk with my manager","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26284945","Text":"yes, it works. thank you. Is it same rule for php condition?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26284335","Text":"+1 This is how to do it.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26284191","Text":"@KyleCopeland . . . You need to talk to someone who understands your environment and has permissions to do things like adding an index.  There is probably a simple index that will improve performance a lot; you need someone local who has a bit more knowledge.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26284066","Text":"Hi and welcome to Stack Overflow. Someone posted this identical answer 5 minutes before you and a flaw has been pointed out... there&#39;s no need to post in these circumstances.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283929","Text":"Thanks for the syntax on creating an index. It looks like I cannot create one because we are using a view for that table.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283852","Text":"I am running at a column in a table. When I do a basic select statement it becomes sluggish. If I execute the function on one value it works fine.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283784","Text":"@KyleCopeland . . . The index should make it much faster to find one of the rows you are looking for.  Because you are running the function inside a query, the performance may be affected by other things.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283646","Text":"from the syntax it seems OP is using MS Sql Server","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283533","Text":"It does not seem that OP requires unique values.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283456","Text":"HLGEM can you please share a little more on derived table joins. I&#39;ve never heard of them before. Why are the beneficial?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283406","Text":"That worked perfectly!  I&#39;m still learning SQL and I&#39;ve never used the SUM function before.  Thank you for your help!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283325","Text":"Also, when doing a this select statement outside of the function, it&#39;s performance is 0 secs","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26283290","Text":"Thanks for your quick reply Gordon. I&#39;ve never created an index before. What is their purpose?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26282063","Text":"Looks like this one will work for us, thanks!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281926","Text":"@JustinDanielson . . . <code>coalesce()</code> returns the second argument if the first is <code>NULL</code> (and it can take more than two arguments).  As for the <code>select</code> . .  yes, it makes sense to do it there too, if you would rather see <code>0</code> than <code>NULL</code>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281654","Text":"Does coalesce(i.cnt, 0) return the cnt if it&#39;s non null, otherwise 0? Would it be appropriate to coalesce in the column list too?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281435","Text":"+1 <a href=\"http://sqlfiddle.com/#!4/740da/12/0\" rel=\"nofollow\">It works</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26280915","Text":"+1 the CASE expression is clever.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279922","Text":"I&#39;m so dumb... Thanks so much!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279661","Text":"Correct. That&#39;s how foreign key&#39;s work. Every Topic must have a SubjectId in that matches a row in the Subject Table. If is now impossible to have a Topicless Subject.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279576","Text":"Dave - So am I correct in saying I don&#39;t need to code any DELETE ... keywords and it will not let me delete SubjectId=3 in the subject table if there&#39;s a topic with SubjectId=3 ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279521","Text":"Updated my answer.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279426","Text":"Yes Subject is the Parent and Topic is the child table.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279352","Text":"Dave - I am sorry but I am a bit confused by &quot;Specifies what action happens to rows in the table that is altered, if those rows have a referential relationship and the referenced row is deleted from the parent table.&quot;  What does this mean as it relates to my Subject and Topic tables ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26263170","Text":"Which DBMS are you using? Postgres? Oracle?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254248","Text":"@MikeWang if have already figured it out remove the question","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254226","Text":"provide your entities codes","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252156","Text":"@RhianA CTE does not work in MySQL.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251540","Text":"never mind, figured it out already. thanks.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251131","Text":"When asking query related questions, especially when you don&#39;t provide your version of the query, please at least help those who want to help you and provide your table(s) schema, sample data, and desired output based on it. Better yet spend one minute and create <a href=\"http://sqlfiddle.com\" rel=\"nofollow\">sqlfiddle</a> with your sample data.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250485","Text":"use common table expression WITH","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250334","Text":"In Access <code>Name</code> is a reserved word so should be surrounded in square brackets.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250315","Text":"@FilipeSilva I want to be able to find all players that play for ALL football teams. I found the query with the using NOT EXIST. I want to find it using COUNT instead and still get the same results.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250314","Text":"I am confused by this statement &quot;all the values in column &#39;BasedOnDate&#39; are being set to 1 after the left join&quot; as the value in the sample data is 1?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250310","Text":"Are you sure you do not have a where clause somewhere?  Can you include the actual results in the question?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250218","Text":"How do you mean you want to change not exist to count? What do you want to count?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26249788","Text":"Is <code>Table2.Date-4</code> supposed to be the date minus four or is the name of your column <code>Date-4</code>. In the case of the latter you need to enclose those columns in brackets a la <code>Table2.&#91;Date-4&#93;</code>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26381551","Text":"Thanks Gordon for such a prompt answer, yes it works fine. Maybe you know how to achieve the same thing without analytic functions (for MySQL)?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26377399","Text":"Thanks for that, I&#39;ll give it a try and report here soon.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26377365","Text":"changed query, try that","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26377330","Text":"would you please help me on this?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26360433","Text":"That didn&#39;t have anything on what to use with the variables within the <code>INSERT INTO</code>. I found that I was having issues with the data in the variables containing special characters, so I needed to format the variables in the <code>INSERT INTO</code> string as such <code>&#91;&quot; &amp; myString &amp; &quot;&#93;</code>. Now I&#39;m getting the <code>80040E10</code> error saying &quot;No value given for one or more required parameters.&quot;, yet for every A, there&#39;s an A, for every B, there&#39;s a B...so every parameter has a value.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26358237","Text":"When in doubt, read the <a href=\"http://msdn.microsoft.com/en-us/library/ms714540\" rel=\"nofollow\">documentation</a>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26356004","Text":"@Mike - Sorry, I may have misunderstood your requirement that you only want to return a row with the latest inc_date regardless of the emp_id but I was just thinking that you may want to have one row per distinct emp_id.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26355147","Text":"The answers didn&#39;t help. It seems as though it&#39;s HOW I&#39;m sending the data in the <code>INSERT INTO</code> line. I&#39;ve seen instances on the internet where strings get added as <code>&#39;&quot; &amp; myString &amp; &quot;&#39;</code>, dates and times get entered as <code>#&quot; &amp; myDateTime &amp; &quot;#</code>, etc. I believe the issue is how I&#39;m inserting the currency. I have it formatted in my database as &quot;currency&quot;, but even with setting the parameter for currency, I still have issues. Is there a good site where I can see the different formats as I explained in the beginning for <code>&#39;&quot; &amp; myString &amp; &quot;&#39;</code>?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26339824","Text":"Thanks alot, will accept your answer, and i will try out from here, I might get back to you i get it to work! :)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26312718","Text":"+1 Cleaner way of Dominic Rodgers&#39;s answer imo","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26312711","Text":"See the answers to <a href=\"http://stackoverflow.com/q/8354859/1630171\">this question</a>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26311567","Text":"Ok, I&#39;m getting the hang out of <code>CreateParameter()</code>, but now I&#39;m faced with a different issue. This one program runs off of several others. It is called when the first program is done. Each program sends different data, but the VBScript is designed to accept data from every program. I have one line that is set up to input currency, <code>Set p5 = cmd.CreateParameter(&quot;@p5&quot;, 6, 1, 7)</code>, but I&#39;m getting the error <code>Application uses a value of the wrong type for the current operation.</code> I&#39;m guessing because I&#39;m not sending a $$ at the moment. Any suggestions?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26310881","Text":"<code>cmd.CreateParameter(...)</code> creates a parameter of a particular type. My example is using type 3 (<code>adInteger</code>) for all parameters, but that may not match the actual type of the fields in your database, so you probably need to change it.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26310654","Text":"What does &quot;adjust parameters as needed&quot; mean? What parameters should I adjust and how should I adjust them?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26310342","Text":"Like I already said: adjust the parameter type as needed. The parameter type must match what the database expects for that particular field.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26310242","Text":"Ok...I have that. Now, I&#39;m receiving a different error: <code>Application uses a value of the wrong type for the current operation.</code> The code is <code>800A0D5D</code>, and it&#39;s happening on the line <code>cmd.Parameters(&quot;@p1&quot;) = strSplitData(0)</code>. Is it because <code>strSplitData(0)</code> is an array? I need this to accept an array of data from a CSV or comma delimited text document.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26309993","Text":"@Lou I updated my example with code for opening the connection.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26309801","Text":"I have <code>conn.Open strConnect</code>, which is immediately after where I define <code>strConnect</code> with the provider and the path to the database. Should I change it to <code>cmd.Open strConnect</code> seeing as <code>conn</code> is consumed when setting <code>cmd</code>?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26309598","Text":"@Lou You need to <code>Open</code> the connection first.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26309339","Text":"The WSH error that I&#39;m getting is on line 24: <code>Set cmd.ActiveConnection = conn</code>. The error code is <code>800A0E7D</code>, the source is <code>ADODB.Command</code>, and the error is <code>Requested operation requires and OLE DB Session object, which is not supported by the current provider</code>. I added everything you sent above. The line for <code>conn</code> is <code>Set conn = CreateObject(&quot;ADODB.Connection&quot;)</code>. I even made sure everything has been Dim&#39;d.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26308305","Text":"Sorry to say this but this SQL code at the bottom is the code I had before the top one. ;) The top one was an attempt to get out of the problem of GROUP BY using the row-value and not the CASE-value.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26306740","Text":"I just found out that it&#39;s need to make it look like i do in my example where everything is 0 and last package equals all the data put together.\nI also understod that you I can chose the package with for instance the lowest ID number or Highest to be the one to view all the data","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26306408","Text":"Yes, I believe so. It seems you are past the point of asking about a.*=b.*, correct? It looks like your SQL is now approaching a good solution, eh? Good job. I&#39;ll add how I would do this soon.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26306173","Text":"yes, this is the correct word. It would be appreciated if you help me accomplish this","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26305094","Text":"so if you give sizes = (1, 2) you want to get records for which are exist size 1 or 2, but you want to get all sizes for this records?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26304582","Text":"It will list all products if I do so! It is needed to restrict records to which we want through <code>$size_list</code>, but I need all available sizes for each product","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26303656","Text":"have you tried to remove <code>where size IN(&quot;.$size_list .&quot;)</code> from query?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26303605","Text":"wait a sec, I have to check","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26302395","Text":"@Khazar yes it is very complex. But just wanted to demonstrate that it was possible","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26302087","Text":"This is a good answer to my question, but it is sad though that it is only possible in such a clutterd manner. Now only the problem needs to be solved.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26301544","Text":"Is the explanation understandable, in the way I wrote it?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26301261","Text":"OMG, I think there is something wrong with this query I did not mention. I think <code>it does not list all the sizes for the product. It does just the sizes that are in $size_list</code>. am I wrong Roman?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26298581","Text":"Thanks for you respond, but what about totalWeight?\nI just did the partition by and seems that my database goes in a very long load mode.\nI just want to note that totalWeight is a result from a case statement. Example would be CEILING(SUM(CASE When (Weight != 0 AND Volumen != 0) AND Weight &gt;= (Volumen * @zeroVoluFac) Then Weight&quot;) AS TotalWeight","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26298168","Text":"Thanks alot ill try you example and i will get back to you!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26297426","Text":"hi, i have created index on PACK table like this              <code>CREATE NONCLUSTERED INDEX &#91;idx_pack_company_country_pack_desc&#93; ON &#91;dbo&#93;.&#91;PACK&#93;\n(\n\t&#91;PACK_CD&#93; ASC\n)\nINCLUDE ( \t&#91;COMPANY_CD&#93;,\n\t&#91;PACK_DESC&#93;,\n\t&#91;COUNTRY_CD&#93;) WITH (PAD_INDEX = OFF, STATISTICS_NORECOMPUTE = OFF, SORT_IN_TEMPDB = OFF, DROP_EXISTING = OFF, ONLINE = OFF, ALLOW_ROW_LOCKS = ON, ALLOW_PAGE_LOCKS = ON) ON &#91;PRIMARY&#93;\nGO</code> is it right? and as company_cd and country_cd are primary keys i think they are already indexed..","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26296112","Text":"An important detail given the OP didn&#39;t say what DBMS this is for.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26296084","Text":"I&#39;m sure he figured out the parenthesis and I&#39;m sure that its lack is not what made two rows appear instead of one.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26294936","Text":"i tried that too but it is still throwing the error.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290872","Text":"@t-clausen Sorry, don&#39;t know why I didn&#39;t see your answer while giving mine.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290494","Text":"For second or third queries he can do a <code>NOT IN</code> with the previous results. That should solve a lot of headache.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290240","Text":"Beautiful! Many thanks!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26287264","Text":"I tested it with an Access 97 DB and the <code>Microsoft.Jet.OLEDB.4.0</code> provider (using the connection string from <a href=\"http://www.connectionstrings.com/access/\" rel=\"nofollow\">here</a>), and it worked just fine. Please update your question with the exact error message you&#39;re getting, and the line that raises the error.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26286271","Text":"Ansgar, I tried what you said and it&#39;s saying I can&#39;t use this because of the provider I&#39;m using. I&#39;m using <code>Microsoft.Jet.OLEDB.4.0</code>...I would need to use <code>Microsoft.Office.12.0.Access.Database.Engine</code>, then recreate the database as Access 2010 doesn&#39;t allow you to change file types once you create a database (if it does, I haven&#39;t figured it out and already destroyed a .accdb database just to create a .mdb)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26282865","Text":"Thank you all for the quick reply. But I should had been more specific because I thought the original info would had been enough. The issue at hand is that the ID Number and ID code can have duplicate if they have different address like the ones I marked with a *. But there cannot be a duplicate of a ID number with a different ID code and address. Is there a way to query for the duplicate with the $ mark?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26282769","Text":"You mean like Gidil response? I&#39;ll try to.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26282534","Text":"Don&#39;t forget - rank allows for ties (you can have more than one row with a rank of 1.) I think what you&#39;re getting at is what Ramblin&#39; Man posted above. :)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281856","Text":"@PatrickMarchand I&#39;m not sure I follow you. What is the <i>general case</i> in which this query doesn&#39;t work?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281642","Text":"This works in the one emp_id example, but not the general case.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26280593","Text":"typo only - left off one closing parentheses.  Surprised it even worked.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26280281","Text":"Works also with your solution except i get 0.0015sec instead of 0.0007sec with mine. So i guess i&#39;ll stay like that :)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26280186","Text":"Yes, you can create a trigger to delete a record from Child table before parent table. Also you can go for option to not  have Parent child relationship between tables then you can add a bit type column in your child table and by default its value would be 1. So when a value is deleted from the parent table you can turn that value to 0,  and whenever you query the child table always look for rows with value as 1. But this option doesn&#39;t guarantee referential integrity and you may end up with some inconsistency.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279797","Text":"Can&#39;t see anything stupid in your query :) Instead of a join you could do: <code>select * from package_content where package_id in (select package_id from ...)</code>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279710","Text":"Thank you! As you can see i updated my question with the final query. Have to test it more because i use about 8 criteria in reality. But looks good. If you see something weird, dont hesitate :p Thank you for your time!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279641","Text":"Yes I would like to simply prevent deletes on the subject if children still exist and reference it.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279561","Text":"@Akash, isn&#39;t that what you wanted in your question? Prevent Deletes.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279418","Text":"Akash - I tried my code without ON DELETE ...   When I tried to delete a subject which had children it would not work. So do I really need a trigger? I am more confused now.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279411","Text":"@DaveShaw Yup, just realized it, I have updated the same, thanks","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279362","Text":"Isn&#39;t Restrict Oracle only?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279290","Text":"Okay so are you saying having DELETE NO ACTION is the same as my not putting anything?  DELETE RESTRICT is something new so I will try to check that out.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279180","Text":"Also - be careful of avoiding the second or third queries once you have <i>enough</i> results - you&#39;d need to check for duplicates there before determining whether you really have enough.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26279089","Text":"Add a depth incrementer to the cte and use that for ordering","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278995","Text":"There&#39;s no guarantee of order with that query.  What works in testing may not work in production.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278923","Text":"Very true, it worked for the sample data but it seemed likely that you would ultimately need a recursive approach or similar.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278886","Text":"@Mike That is what I meant. This select can return several records and it could be interesting to get them all and not just one of them because it might be an information itself or there should be another criteria to determine which one to get. (rownum = 1 in this case is a bit arbitrary. Anyway this is up to Azzi to determine it.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278733","Text":"This won&#39;t work correctly when subfolder ID is bigger than it&#39;s parent ID.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278680","Text":"Do you mean a trigger that will check to see if child records exist before allowing the parent to delete?  I am sorry I don&#39;t understand about the 0 or 1. Can you add that to your answer with just a bit more details. Thanks","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278656","Text":"For case 2, he just has to check duplicates before merging lists.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278641","Text":"Please explain the requirement(s) in english, including (but not limited to) what you need to do with the CASE logic, and the matching logic.  Leave the SQL out for now.  We can provide that, once we clearly and unambiguously understand exactly what needs to be done,","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278632","Text":"So to avoid any inconsistency you can define a trigger to delete a row from the child table, or add an additional bit type column in your child table and set it to 0 or 1 when the row is deleted from the parent table and query it accordingly.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278605","Text":"You can go for that option but that would result in inconsistent data.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278544","Text":"Hi Mike it would return the one value which will be max. Even if there are two.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278504","Text":"@C.Champagne - max returns one date, but there&#39;s nothing indicating you can&#39;t have two records with the same <code>inc_date</code>. (Could be a yearly pay-rise so everyone has a record the same day, unless the <code>where</code> clause specifies an ID). Of course, if there are, which one you get back from the <code>rownum</code> check is kind of random if it&#39;s only ordered by <code>inc_date desc</code>...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278501","Text":"The <code>select MAX(...)</code> portion does indeed return a single record; however, that record is used in the where clause. There may be multiple rows that have an <code>inc_date</code> equal to that of the <code>MAX(inc_date)</code>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278332","Text":"This helped me a lot. I am using SQL SERVER and found something equivalent to Oracle&#39;s CONNECT BY. This fits what I need :-)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278294","Text":"Do I need to have either &quot;ON DELETE CASCADE&quot; or &quot;ON DELETE NO ACTION&quot;  Can I just not have either ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278257","Text":"@AaronBertrand You&#39;re right, thanks for pointing it out.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278236","Text":"@Mike there should no error since <code>select MAX(...) ...</code> always returns one record. It could be even a better solution if we expect all the records having the the highest value of <code>inc_date</code>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278203","Text":"Thanks for your explanation.  If I do not have &quot;ON DELETE CASCADE&quot; and there is still something in the Topics table when I try to delete a subject then will that result in an error and failed DELETE ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278122","Text":"The problem is with the GROUP BY and the CASE. I need the value that comes from the CASE but I can&#39;t use an alias(which I need to do because I don&#39;t want to group FIELD3, FIELD4 and their unfiltered values) unless I use a subselect. So yes the subselect is normally pointless, but not in this case.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278118","Text":"@MarcB If a question is tagged for a particular DBMS, then don&#39;t you think the answer should be appropriate for that environment? A mySQL answer might be inappropriate under SQL Server.  A T-SQL answer may be inappropriate under DB2.  Personally, if suggesting an answer for a system I am unfamiliar with, I try to check the appropriate reference if I have time.  And I generally include a caveat that my experience is primarily on ___.  This gives readers a heads up to    be a bit more cautious in taking my answer verbatim, to double check the details, and hopefully be more lenient in a critique.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26278084","Text":"@AlexPoole yep I completed my answer too late. I am not sure there  is a better solution and as you mentioned it, using an index should help.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277917","Text":"+1 thanks for mentioning len([string]). I totally forgot about it.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277895","Text":"See Jafar&#39;s comment.  Your where clause is wrong. FROM USERS WHERE username1 = o_username should be replaced with FROM USERS WHERE username1 = USERNAME_FIELD_IN_TABLE (whatever that is).","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277882","Text":"Yes I tryed this and it was saying error near ELSE","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277872","Text":"Thanks for the simple solution and demo","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277851","Text":"+1 Thanks for the answer and it handles even the case when there are zero underscores but I can&#39;t use a CTE as this is a small part of a much bigger query","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277759","Text":"Also I would like to add that you are getting this error because, when you delete a row from the Subject table, SQL server will delete a row from the Topics table(on Delete cascade) and then it will try to delete a row from the sub topics table. So here you can see that the system is just counting the cascades path and to avoid any worst cases its trying to avoid any multiple levels Cascade.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277602","Text":"@AmitG: I added a SQLFiddle. Can you please demonstrate your problems in there?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277487","Text":"Oracle will optimise this if <code>inc_date</code> is indexed (you&#39;d see <code>stopkey</code> in the explain plan, I think). But this is the same as Mike&#39;s answer, including the sort ordering problem that originally had.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277469","Text":"The output of the case statement above are numeric values 0 and 1 for each row, if you said <code>ORDER BY 1</code> you&#39;d be using the column index.  Think of it like this, if you put the <code>CASE</code> statement in your <code>SELECT</code> you&#39;d get a value for each row, then you could order by that value. Putting it just in the <code>ORDER</code> by just spares you from returning the output of it.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277443","Text":"The OP says that this gives him two rows instead of one.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277436","Text":"I got wat u means.. I works... I fixed your solution to my program and its really cool.. thanks","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277399","Text":"@JafarKofahi Thanks, updated the answer to include the sort order.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277390","Text":"I would caution you to use functions on columns used in the predicate as they can prevent the use of index seek operations.  Something like this will allow an index seek, WHERE [Date] &gt;= DATEADD(MONTH,DATEDIFF(MONTH,0,@BeginDt),0) AND [Date] &lt; DATEADD(MONTH,1,DATEADD(MONTH,DATEDIFF(MONTH,0,@EndDt),0))]","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277365","Text":"Yes - it will work on MySQL though.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277342","Text":"I&#39;m not sure this would work if there&#39;s duplicate values for <code>inc_date</code>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277330","Text":"That is not going to work in all variants of SQL...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277314","Text":"I think ur order by should use <code>desc</code> since he is looking for max","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277303","Text":"@Raghav take a look at my SQLFiddle.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277302","Text":"DATE_ADD() doesn&#39;t help. I tried like select * from employee \nwhere admissiondate&gt;=&#39;2013-01-01&#39; \nand admissiondate&lt;=DATE_ADD(&#39;2013-07-31&#39;,interval 1 day) with no expected output.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277266","Text":"To me it seems wasteful to determine the length.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277260","Text":"DATE_ADD/ interval did not help either.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277246","Text":"In your <code>ELSE</code>, the starting position should be 2, not 1. 1 is the start of the string, so the output will still include 9.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277236","Text":"yes. I can change it by adding ONLY one day in it.  How to do that?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277232","Text":"use the DATE_ADD() function","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277217","Text":"To me it seems wasteful to determine the length.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277209","Text":"Why can&#39;t you change the value after you get it?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277205","Text":"try <code>&#39;2013-07-31&#39; + interval 1 day</code>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277168","Text":"updated the output...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277129","Text":"is there anything like admissiondate &lt; &#39;2013-08-01&#39;+1","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277068","Text":"in runtime I am getting &#39;2013-07-31&#39; I cannot change it to &#39;2013-08-01&#39;","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277027","Text":"The output is same as the current one, but instead of null, it gives 0s... I need to merge the rows to a single one...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277012","Text":"Didn&#180;t know that we can use CASE in ORDER BY. I am using a compact version of SQL SERVER and I think it worked. Thanks!\n\nBut I need to ask if you can please explain me what the order by is doing in this code. When we use ORDER BY 0, ORDER BY 1, doesn&#39;t it orders by column index? Or the result of case statement is working with another approach that I dont know?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276996","Text":"I can add a group by to the select.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276990","Text":"If it&#39;s not giving you the counts you didn&#39;t copy it exactly.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276979","Text":"Please try now, I&#39;ve edited the code.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276974","Text":"perfect!  thank you sir.  appreciate the effort.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276941","Text":"I think he meant that he cant use any aggregate functions since its a part of a bigger query coz he cant add a <code>group by</code>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276918","Text":"If you convert to decimal(7, 2), you will lose some precision, and I&#39;m not sure this is intentional or not.  money and smallmoney both can accommodate 4 decimal places: <a href=\"http://msdn.microsoft.com/en-us/library/ms179882.aspx\" rel=\"nofollow\">msdn.microsoft.com/en-us/library/ms179882.aspx</a>  The OP does not indicate why he wishes to do the conversion in the first place.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276917","Text":"Tell me where do you see a sum ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276910","Text":"that doesn&#39;t give me the counts.  only groups the days.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276906","Text":"in the OP he said &quot;Note : I cannot add a sum surrounding this. Its &quot;","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276870","Text":"I updated my answer. You could remove the parentheses from there <code>where</code> clause if you like. I added them for better readability.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276852","Text":"@JafarKofahi feel free to explain yourself ! It seems to me that it&#39;s exactly what he&#39;s loooking for...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276785","Text":"this wouldnt go with what the OP asks for","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276765","Text":"this wouldnt go with what the OP asks for","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276703","Text":"Thank you. I updated my question, how can i now add a new criteria in your query ? With an other where clause and a second having count ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276591","Text":"Yes got it .......there would have been some problem with fetching it....Thanks for comment","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276401","Text":"thanks Alexander, that fixed it , just wasnt sure of the syntax","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276320","Text":"You don&#39;t need to explicitly declare the cursor ...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276201","Text":"Thanks working well too !","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276144","Text":"@jojoob <a href=\"http://www.postgresql.org/docs/current/static/functions-comparisons.html#AEN18030\" rel=\"nofollow\">postgresql.org/docs/current/static/&hellip;</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276127","Text":"Yes you need <code>3</code> if you search for 3 numbers. First I filter the data with there <code>where</code> clause. Only <code>content_number</code>s <code>11</code> and <code>22</code> remain. Then I use <code>count(distinct content_number)</code> to count the number of the remaining <code>content_number</code>s. The <code>distinct</code> is used to make sure there is not only 2 times <code>22</code> but <code>11</code> and <code>22</code>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276066","Text":"Thanks a lot! Can you say me where I can find this in the documentation? I&#39;m just interested.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276061","Text":"That is perfect, thank you so much ,","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26276052","Text":"wow! It works fine ! Thx so much. I used your second query, may i ask what the (distinct content_number) = 2 means ? What if i search for 3 number ? Should i then use (distinct content_number) = 3 ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275866","Text":"Can you please provide some sample data? We can work it out...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275686","Text":"It was the [] who was blocking the query, I used &quot;&quot; instead and it worked, but it isn&#39;t exactly what I wanted, it&#39;s returning the same result as the select from Fabien TheSolution","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275615","Text":"I did that, but I am getting another error message (Edited into original question)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275547","Text":"I see no commas in the wrong place, I used the exact same code as you posted (except for the tag_ug which is tab_ug :P)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275489","Text":"That usually means you have an extra comma after your very last field you specify in your select statement....is there one there?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275431","Text":"I&#39;m getting this error : &quot;FROM keyword not found where expected&quot;","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275322","Text":"that&#39;s not what I want, the where clauses cant be together, it filters the query more than it should where it shouldnt... I need to use a full join, but it&#39;s not working","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275222","Text":"and I will read up on OVER / PARTITION ;) apparently it is useful in exactly your use case ... when you want aggregate information for some group without actually rolling up the group into a single row","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274738","Text":"Please go yell at whoever you want yourself. The ANSI SQL standard clearly specifies the double vertical bar as the concatenation operator.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274684","Text":"Hi Graham, thanks will read up..  Not sure what the database is so will find out!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274538","Text":"Great!, both work for me.  Really appreciate your help with this one.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274528","Text":"Please go yell at the SQL standards body and tell them to settle on a standard operator, then...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274416","Text":"&quot;+&quot; is not the concatenation operator, your example will fail if there is a non-numeric column. Even if you use the proper concatenation, it won&#39;t work correctly in many cases. For example <code>&#39;a&#39; || null || &#39;c&#39;</code> and <code>&#39;a&#39; || &#39;b&#39; || null</code> will both return NULL, while the intent obviously would be to treat these combinations as different. On the other hand, one NULL value is not equal to another NULL value, so <code>&#39;a&#39; || null || &#39;c&#39;</code> and <code>&#39;a&#39; || null || &#39;c&#39;</code> will not be equal either, though intent in this case would be to treat them as equal.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274334","Text":"(although mysql has some extra different behaviour for GROUP BY, hence Alex asking which DB system you have)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274260","Text":"Sure, i just waited for 5 minutes to allow it","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274008","Text":"@HotlansyHttlandy, I can understand that. But from my perspective I answered the question at hand. I don&#39;t really know what you want because that&#39;s not clear from your question.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273957","Text":"I am still not sure how to do it.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273900","Text":"I want to the TargetRoom and SourceRoom into DemoRoomMap but I want them distinct! one source room, one targer room in the query above I am getting the following:1942\t2025\n1943\t2025\n1944\t2025\n1945\t2025\n1946\t2025","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273795","Text":"@PriceCheaperton show your exact query which does it.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273794","Text":"yes, changed the answer","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273728","Text":"Can you pls mark my reply as answer","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273648","Text":"You are correct! Thanks very much.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273516","Text":"you welcome :) !.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273454","Text":"Thank you it works like a charm","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273151","Text":"<code>Conversion failed when converting the varchar value &#39;London&#39; to data type int.</code> - i get this when using UNION...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273145","Text":"Also we can just use select convert(decimal,@money), so in this case there will be no decimal point.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273115","Text":"With Decimal Datatypes we can optionally use precision and scale. Precision is the maximum total number of decimal digits that will be stored, both to the left and to the right of the decimal point. The precision must be a value from 1 through the maximum precision of 38. The default precision is 18.\nAnd Scale is the number of decimal digits that will be stored to the right of the decimal point. This number is subtracted from p to determine the maximum number of digits to the left of the decimal point. Scale must be a value from 0 through p.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273047","Text":"<a href=\"http://msdn.microsoft.com/en-us/library/ms187746.aspx\" rel=\"nofollow\">msdn.microsoft.com/en-us/library/ms187746.aspx</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26272945","Text":"Sonam thank you for answering, can you explain me what you mean in (7,2) ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26272515","Text":"works. Thx a lot","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26272472","Text":"I included this on purpose to demonstrate the chararacteristic of the table. There may be cases where the same ID with the same values in parameter 0 and 1 exists in multiple rows. However, in this case the date will be different","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26271957","Text":"Indeed formatting the queries help a lot to understand what is wrong with it...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26271956","Text":"You beat me for a minute :P, but I just tried on Oracle 11g. Apart from the <code>group by</code> I had to remove the <code>AS</code> in <code>AS TMP</code> for it to work.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26271866","Text":"works great, thanks!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26271717","Text":"Yes, that seems to be the only syntax error","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26271590","Text":"@t-clausen.dk, you are right, I was orginally trying something else and forgot to remove the extra cast.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26271388","Text":"Thank you for your time and help!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26271357","Text":"Thank you for your time and help!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26271110","Text":"Oh i so agree with this, 2 new columns and leave the TEXT column alone, it seems like you have an unnecessary conversion to varchar(10)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270797","Text":"Thanx!! Amazingly fast response!!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26318656","Text":"Why downvotes!? Try this query before. Is the result our friend wants.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26311168","Text":"Using the mssql object in the server side scripts, you should be able to execute pretty much whatever SQL command you want.  See <a href=\"http://msdn.microsoft.com/en-us/library/windowsazure/jj554212.aspx\" rel=\"nofollow\">msdn.microsoft.com/en-us/library/windowsazure/jj554212.aspx</a>.  Does that help?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26299432","Text":"@user2637680 your most welcome dont forget to accept as answer if it help u to solve ur problem and you think it best one among all","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26299370","Text":"Thank you for your input, this also provided the required result.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26299228","Text":"@bluefeet thank you very much this worked perfectly. This experience has inspired me to hit the books and learn more about SQL.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26294709","Text":"Looks like i made little misformed question.\nI ask, is it possible to handle SQL DB operations like INSERT or UPDATE from Mobile Services Scripting. Without manual REST API calls.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26294378","Text":"+1 although I&#39;d look at possibly using an outer join to room_definition instead of a select clause - but it depends.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26292345","Text":"Hi Munyul,This gives me the result I am looking for when run as is but when i add it to the whole query i get the following error: Msg 116, Level 16, State 1, Line 19\nOnly one expression can be specified in the select list when the subquery is not introduced with EXISTS.\nWhat I am trying to achieve is a query that can be run in an excel sheet as a custom report, the software company as a connector that gets the info from the DB and then it can be organised in a pivot table.  The full query is what I am trying to put together and I think it is beyond my SQL skill set.  thanks for your help.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26281657","Text":"+1 for good answer","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26280525","Text":"+1 It&#39;s surprising to me on how few developers know that the data type precedence exists. Even fewer understand the negative performance impact of matching on unlike types.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274325","Text":"Thanks for your help, but yea someone tagged that for me.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274238","Text":"So usually you have two options - change the query to first query that navigation entity and expand original entity on it, or create service operation and do all the fancy logic and filtering in it. I prefer second way.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274181","Text":"Yes, you can&#39;t specifiy conditions with 1 to many navigation properties in OData, but can do with 1 to 1 using resource path syntax. Also startswith just have different syntax <code>startsWith(field,&#39;value&#39;)</code>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26273271","Text":"@MichaelJSwart nowits ok","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26271353","Text":"Ref: <a href=\"http://stackoverflow.com/questions/7412722/can-an-odata-query-specify-a-filter-that-references-a-nested-entity\" title=\"can an odata query specify a filter that references a nested entity\">stackoverflow.com/questions/7412722/&hellip;</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26271331","Text":"Sure, here it is: <a href=\"http://sqlfiddle.com/#!9/48b23/7\" rel=\"nofollow\">sqlfiddle.com/#!9/48b23/7</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26271194","Text":"Well even OData v3 does not support &quot;Any&quot; clause also you can search and retrieve entity with id and search its navigation properties, but I am doing other way, we are returning list of entities whose navigation properties match certain conditions. I want to search for all customers whose broker&#39;s name start with something, Customer.Broker.Name.StartsWith , how to do this in OData?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270826","Text":"I don&#39;t really know how Oracle will run the subquery, you&#39;d have to run an explain plan. But all the data will be read, prepared and sorted in Oracle and that&#39;s something it is build for and does pretty well. Plus you eliminate the overhead from preparing a query, opening a cursor, reading the results, closing the cursor,...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270813","Text":"who told you that? OData support both of this things.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270796","Text":"Me, The person doing it so there would be 2 querys one for up one for down sorry for confusion","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270745","Text":"OData endpoint does not support filtering navigation properties and customization of return fields. And you can enforce security rules in form of simple lambda expressions.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270527","Text":"Still receiving the same error message. Do I need to remove the commas and parenthesis? Line 114 is the <code>strSQL = ...</code>, so it&#39;s something wrong with that line.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270448","Text":"@bluefeet, I just read the desired results again - you are correct. +1","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270416","Text":"I think i understand your concept but wouldn&#39;t that defeat the purpose of not making a bunch of queries or sub-queries in this case ? Correct me if i&#39;m wrong but wouldn&#39;t that &quot;(*subquery on room_definition *)&quot; be evaluated for as many times as i have squares in my HTML table ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270342","Text":"@LmC what determines rounding up or down ? a variable or a column","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270244","Text":"Add square brackets to the table and column name containing spaces: <code>&#91;Macro Tracking&#93;</code> <code>&#91;App Name&#93;</code> <code>&#91;User ID&#93;</code>...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270143","Text":"it is in fact OData endpoint","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26270105","Text":"E.g 3.1 may be asked to go to 3 or 4 so thats why i was looking to round up and round down","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269886","Text":"@LmC Please provide sample data and expected result if this is not what you want.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269840","Text":"@LmC it is rounding off to nearest whole, that is what i assumed you needed. Isn&#39;t this the result you needed ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269704","Text":"@MaxK sorry to hear that.. I can&#39;t help you then..","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269664","Text":"Ok...just tried that, but now I&#39;m receiving the following WScript Host error:\n\n&#39;Script: C:\\Tracking App.vbs&#39;\n&#39;Line: 114&#39;\n&#39;Char: 2&#39;\n&#39;Error: Command text was not set for the command object.&#39;\n&#39;Code: 80040E0C&#39;\n&#39;Source: Microsoft JET Database Engine&#39;\n\nAny ideas how to fix this?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269568","Text":"I dont see floor or ceil been used though and that is needed","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269412","Text":"Forgot to mention that I am stuck to IBM Informix 10. rank over doesn&#39;t work there, as well as subqueries in the from clause","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269243","Text":"yes you are right! For every open I dont have a close Now it got worked after matching every open with a close. Thanks for the quick response.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269223","Text":"@a_horse_with_no_name then by all means keep doing what you do. Eventually you will change your mind","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269165","Text":"@Lmc example included","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269156","Text":"Sorry for saying that :) - but I don&#39;t consider this &quot;bad code&quot;. It&#39;s a valid condition.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269108","Text":"thanks..done some minor changes it helped.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269007","Text":"@2vision2 Also, are you doing any multi-threaded code here (e.g. GCD, <code>NSOperationQueue</code>, or any asynchronous techniques)? Special care must be taken when accessing a database from multiple threads/queues.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268992","Text":"@a_horse_with_no_name making index to compensate for bad code, sorry for saying is bad practice","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268973","Text":"+1, Mind posting the link for update fiddle? Interesting to see this method...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268969","Text":"Would you be able to provide example for both floor and ceil","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268830","Text":"@LmC it has been corrected","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268776","Text":"@2vision2 The closing the database and replacing the reset with finalize are necessary steps. But the root problem is probably that you&#39;re opening the database twice. For example, your code snippet opens the database at the start, but doesn&#39;t close it at the end. If you ran this twice, you&#39;d have problems. Make sure you match up your open and close statements. It&#39;s very important to make sure every <code>sqlite3_open</code> has a <code>sqlite3_close</code> and that every <code>sqlite3_prepare_v2</code> has a <code>sqlite3_finalize</code>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268759","Text":"Msg 529, Level 16, State 2, Line 1\nExplicit conversion from data type decimal to text is not allowed.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268722","Text":"@AdamWenger No. This query is correct, the <code>balance &lt;&gt; 0</code> should be in the outer query. According to the OP, users <code>A</code>, <code>D</code> and <code>H</code> should be excluded because their <b>last</b> balance is zero. +1","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268697","Text":"@AdamWenger That is what I thought initially but based on the desired result that would be wrong.  It looks like the logic is return the max id for user/location as long as the balance is not zero.  If you place that inside the subquery user A will be returned which is not what the OP desired above.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268663","Text":"Thanks for the answer. I tried wht you have said. I removed sql_close and did only finalize I removed reset also still am getting the same error. Am I doing it correct? Please correct me if am wrong.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268659","Text":"You can always create an index on <code>trunc(curdate)</code>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268210","Text":"For SQL Server, User is a keyword so refer to that identifier using: [user]","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268150","Text":"hi,thanks for reply..tried your suggestion but it also taking same time execute","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268066","Text":"exactly what I am searching for! Thanks a lot","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268053","Text":"Sigh... w3schools is really not a good reference for SQL questions. They completely ignore the SQL standard. In this case they completely ignored the standad <code>CURRENT_TIME</code>, <code>CURRENT_TIMESTAMP</code> and <code>CURRENT_DATE</code> functions defined by the standard (and they have many errors on their pages anyway).","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267962","Text":"I think you would want the <code>balance &lt;&gt; 0</code> inside the sub-select so that you do not lose the <code>A</code> User in your fiddle.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267778","Text":"yes now looks like alright +1","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267607","Text":"@JoseRuiSantos now it&#39;s ok","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267552","Text":"About the results in depends highly on what mode you are using (DEFAULT, BOOLEAN, NATURAL LANGUAGE). In this case BOOLEAN MODE gives better results, indeed. (SQLFiddle updated)\n\nThank you for pointing it out!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267496","Text":"You&#39;re right. That wasn&#39;t right syntax. I removed the comma.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267271","Text":"OP wants grouped by location <b>and by user</b>. Also you forgot to exclude the zero balances","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266893","Text":"<code>SELECT * FROM @Foo WHERE EXISTS (SELECT  2, 1 INTERSECT SELECT ColA, ColB)</code> would be better as it doesn&#39;t have the implied <code>DISTINCT</code> of intersect and also allows additional columns from Foo to be returned.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266810","Text":"Great, seems to work well.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266681","Text":"@PabloFranciscoP&#233;rezHidalgo - in that case you would have to define the columns you want to compare the vector which is very different from some ALLEQUAL( vector ) function. Should ALLEQUAL ignore the primary and foreign key columns? what about timestamps? Should null values in the vector be ignore in the comparison or compared exactly IS NULL?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266678","Text":"declare\n  v_gen gender.sex%type;\n  cursor cur_gender is\n  select sex from gender;\n  begin\n    open cur_gender;\n    loop\n      fetch cur_gender into v_gen;\n      if v_gen=&#39;male&#39; then\n        --dbms_output.put_line(&#39;It was &#39; ||v_gen);\n      update gender set sex=&#39;female&#39;;\n      elsif v_gen=&#39;female&#39; then\n        --dbms_output.put_line(&#39;It was &#39; ||v_gen);\n      update gender set sex=&#39;male&#39;;\n      end if;\n      exit when cur_gender%notfound;  \n      end loop;\n      close cur_gender;\n    end; Here it works but if 1st row is male then it sets male to all rows or vice versa, whts wrong in this","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266655","Text":"Corrected a few typos. Nothing returned though as user_id 1 is not the latest bidder with your test data","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266610","Text":"What for do you use the cursor at all?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266438","Text":"Thanks. This produces an SQL error &gt; <a href=\"http://sqlfiddle.com/#!2/b98e4/10\" rel=\"nofollow\">sqlfiddle.com/#!2/b98e4/10</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26266353","Text":"Let suppose (&#39;val0&#39;,&#39;val1&#39;,&#39;val2&#39;) is not a constant value but the result of a select. There are cases where you may want to compare if the result of a subquery match all columns values.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265850","Text":"OP said <code>I knw that we can do it by using only 1 update statemen</code>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265136","Text":"<a href=\"http://weblogs.sqlteam.com/jeffs/archive/2007/07/20/but-why-must-that-column-be-contained-in-an-aggregate.aspx\" rel=\"nofollow\">weblogs.sqlteam.com/jeffs/archive/2007/07/20/&hellip;</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265080","Text":"case 2 : as i used , with some more modification, i solved.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265075","Text":"@user2632133 I&#39;m not sure how to do this in standard ANSI SQL, my guess would be some kind of cursor might work. This works for postgres though, and that is what the question was tagged as.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265073","Text":"<a href=\"http://stackoverflow.com/questions/2777235/why-do-i-need-to-explicitly-specify-all-columns-in-a-sql-group-by-clause-why\" title=\"why do i need to explicitly specify all columns in a sql group by clause why\">stackoverflow.com/questions/2777235/&hellip;</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265060","Text":"for case 1 : as I mentioned in my question, i cant nest my query.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265022","Text":"<i>In sql-server group by needs all columns in select other than aggregate functions.</i> Can I get some reference on this @PraveenPrasannan?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264953","Text":"thanks, it worked.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264875","Text":"@PraveenPrasannan I have already provided this in my question. I&#39;m not looking for that solutions. The reason why my first query didn&#39;t work is what I need.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264773","Text":"@Nikola My mistake. Updated. Thanks for the catch.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264664","Text":"Why do you group <code>r.RoleName</code> twice?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264634","Text":"Your first option worked for me - thanks!\nPresumably the &quot;T&quot; at the end of the query adds an alias?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264511","Text":"That&#39;s great.  Much easier way of doing that. Thanks.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264436","Text":"just need little explain from downoter if something is wrong.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264397","Text":"Changed the answer - I&#39;ve never used it in my work but heard about it, so I thought it would be nice to mention it. I like dynamic SQL more because imho it&#39;s more simple to maintain and I always can print statement to see what I will execute","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264360","Text":"All styles smaller than 100 are non-deterministic because of lack of century (13 can be 2013 or 1913 based on cutoff setting). Also styles 106,107,109,113 because of use of names for months which are different based on language.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264309","Text":"I&#39;ve been warned not to use <code>sp_MSforeachtable</code>, it seems that you can&#39;t trust it when you have many tables in database.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264054","Text":"This works really well, thanks!!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26264052","Text":"You don&#39;t need the comma after <code>relevance,</code>. Also, for some reason results are weird.. see: <a href=\"http://sqlfiddle.com/#!9/48b23/4\" rel=\"nofollow\">sqlfiddle.com/#!9/48b23/4</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26263822","Text":"+1 for using inline table","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26263494","Text":"Exactly what I am looking for. Thanks!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26263464","Text":"Sorry about that.. Actually I tested the query in sybase and pasted here. It worked in sybase, but not working for sql server. It seems you have already got the answer to your question.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26263237","Text":"good understand what actually OP needed without much explanation","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26263189","Text":"<a href=\"http://sqlfiddle.com/#!3/fd119/8\" rel=\"nofollow\">Here is the SQLFiddel Demo</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26263118","Text":"whats the error you are getting? The query is straight fwd, I tested the same and pasted above.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26263066","Text":"Perfect! Thanks","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26263008","Text":"-1 : Not woking","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26262893","Text":"That you are mentioning now.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26262859","Text":"We need to be able to get the o/p without subquery.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26262727","Text":"Yes, Now i have modified","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26262575","Text":"@IgorRomanchenko, done! Thanks.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26262528","Text":"I would probably use the <code>_</code> as a suffix rather than a prefix so the table names could be &quot;properly&quot; sorted e.g. in a GUI tool. But that is mainly personal taste...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26262456","Text":"Microsoft and MySQL do support the standard quoting as well - they just need to be configured properly (i.e. to be ANSI compliant).","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26262311","Text":"Thanks for your help. It definatly gives me something to think about and look into as I wouldn&#39;t have a clue how to use those. I was hoping it would be a bit more basic, but I will start researching","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26262253","Text":"Any explanation or should just take your (lack of)word for it?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26262087","Text":"@FranPl of course we could use <code>CASE ISNUMERIC...</code>; but it seems that  is not needed in this, since the original query didn&#39;t have such test, and didn&#39;t fail...  IMO it&#39;s a bad design.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26261111","Text":"Because I want this to work outside on postgre also like just on paper.  I dont want to rely on postgre.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26261037","Text":"@user2632133 Maybe, but why not use the tools provided by postgresql? If you are unfamiliar with the functions just read the manual :)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26261024","Text":"Then familiarize yourself with <a href=\"http://www.postgresql.org/docs/9.2/static/functions-aggregate.html\" rel=\"nofollow\">these</a> <a href=\"http://www.postgresql.org/docs/9.2/static/functions-string.html\" rel=\"nofollow\">two</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26260905","Text":"Is there a way to do this without the use of array_agg and concat as im not familiar with those two?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26260815","Text":"Good point! But it might be that there are some nvarchars which are not numeric in the column in table A. You would at least have to take care in the expression for that.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26260732","Text":"I would make the computed column in <code>tableA</code> with expression <code>cast(ColumnA2) as bigint)</code>. Usually is much cheaper to scan indexes when they are numeric.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26260623","Text":"In this code, where should i place this?. Thank you","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26260088","Text":"It might be more efficient to limit the update query only to rows, that actually have <code>pear</code> in text.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26260073","Text":"Your answer is so much simpler than my though. Thanks.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26259991","Text":"That&#39;s why I said you should read up about it. The error message is quite clear, isn&#39;t it?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26259792","Text":"thanks for your reply, i tried without the quotes. but it gives the following error:\n\n<code>There is no OLD row in on INSERT trigger.</code>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26259742","Text":"Thank you, this makes a lot more sense now.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26375050","Text":"@AlexanderOvalle Did it help? Do you need more help with your question?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26375025","Text":"If you feel it was helpful please, consider to <b><a href=\"http://meta.stackoverflow.com/questions/5234/how-does-accepting-an-answer-work\">accept</a></b> the answer.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26303968","Text":"The OP already indicates in their post that they expected that the query should work. So what you&#39;ve posted here is merely a statement of the obvious. This would be good as a comment, to confirm that the OP was correct in their expectation. It <i>might</i> have been fine as an answer if you could at least use an <b>MS Access</b> demo. That would partly address the actual question (&quot;where the problem lies?&quot;) and show that the issue at least was not to do with MS Access in general. As it is, however, there&#39;s really little value to your answer at the moment.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26296617","Text":"@ManthreePeiris <code>replace</code> is <code>str_replace</code>.  <code>Instr</code> is something like <code>CHARINDEX</code>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26294574","Text":"Can anyone add more detail on detecting the HTML tables then converting those into SQL?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26290412","Text":"Thax Parado. Got you. Can you let me know what is the corresponding function for <code>replace() </code> ans <code>Instr() </code> in Sybase isql. Because these wont highlight as keywords in isql IDE","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277767","Text":"@Andriy yes you&#39;re right, thanks I fixed it","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277372","Text":"Driver is a cross join of all pairs of players.  This is used for the subsequent joins, to fix the problem that the <code>full outer join</code> causes <code>player2id</code> to be <code>NULL</code>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26277080","Text":"where did driver come from?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26275762","Text":"@Chris Or, you can write a python program that connects to SQL server and runs fabricated queries.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26274715","Text":"awesome....thanks!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26269531","Text":"@user2632133 . . . See my edits.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26268108","Text":"+1 nice solution","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26267175","Text":"Hi Tony, it has worked perfectely!!! Thank you","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26265533","Text":"creating index in project_id and using hint didn&#39;t help. Any other suggestion??","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26262216","Text":"@Parado thnaks a lot","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26262111","Text":"@AshishJaiswal sorry i didnt get u?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26262053","Text":"Amit Can you pleae help me with the same?? i am new to SQL usage","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26261643","Text":"Yes. but project_id would be already indexed if its a primary key. creating index on large data table is not suggested as it takes too much of a time.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26261473","Text":"are u suggesting creating an index on project_id and using hint on the same?? i have partitioned the table by project_id","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26260864","Text":"Index on project_id won&#39;t help i think cause i have already partitioned the same, so using the partition will be more effective right?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26260292","Text":"Yes that&#39;s true. But queries which only use inner joins usually do not get as large. ;)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26259797","Text":"I know it doesn&#39;t matter behind the scenes (yay for good compilers). I personally find it easier to understand if it says <code>JOIN X ON Y.ID = X.ID</code> though. Especially in larger queries it makes it immediately clear that you are doing an inner join. Preference I suppose :)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26259322","Text":"@Sam Behind the scenes the <code>where</code> syntax is an inner join and in my opinion it is easier to read for a human. As long as I just need inner joins and nothing else, I always use <code>where</code>.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26258902","Text":"Join Queries are required to get the data from the above normalized tables..","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26258767","Text":"Why not use a proper join?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26258106","Text":"<i>‘Time 12: Here the number of rows will be 13 for al transaction modes.’</i> – Either <code>13</code> is a typo or I must have missed something. The initial row count is 10 and each of the two transactions prior to Time 12 inserts one row. That totals to 12 in my book.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257807","Text":"not very sure,but try this\nset CurrentLevel=SUBSTRING_INDEX(level_order, &#39;,&#39;, 1)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257673","Text":"@user2631770 I updated my answer to fit your modified question.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257376","Text":"but I have not declared any kind of inner joint...\nIs it necessary to do it..\nCan u please guide with a query without inner joint.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257125","Text":"select\ni.Id\n,i.ImagePath\n,bi.BlogId\n,b.AuthorId\nfrom\n[Blog] as b\ninner join [BlogImages] as bi\non b.Id=bi.BlogId\ninner join [Image] as i\non bi.ImageId=i.Id\nwhere\nb.AuthorId=@authorId.. the query will fetch images for given user","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257073","Text":"declare @blogId int\n\n\nselect\ni.Id\n,i.ImagePath\n,bi.BlogId\nfrom\n[BlogImages] as bi\ninner join [Image] as i\non bi.ImageId=i.Id\nwhere\nbi.BlogId=@blogId\n\nThe above query will fetch images for given blog Id","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257022","Text":"sir  i have provided my tables ..so that now u can guide me properly","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257012","Text":"I added it, it should work","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26257011","Text":"can u please guide me with a proper query..I am confused","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256995","Text":"sir  i have provided my tables ..so that now u can guide me properly","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256807","Text":"In above first query is images per blog, and the second one is images per author..","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256770","Text":"declare @blogId int\n,@authorId int\n\n\nselect\ni.Id\n,i.ImagePath\n,bi.BlogId\nfrom\n[BlogImages] as bi\ninner join [Image] as i\non bi.ImageId=i.Id\nwhere\nbi.BlogId=@blogId\n\nselect\ni.Id\n,i.ImagePath\n,bi.BlogId\n,b.AuthorId\nfrom\n[Blog] as b\ninner join [BlogImages] as bi\non b.Id=bi.BlogId\ninner join [Image] as i\non bi.ImageId=i.Id\nwhere\nb.AuthorId=@authorId","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256712","Text":"@AshishJaiswal  Yeah you can use Coalesce definately.That&#39;s the only way for your desired result which i know and seen yet so i think it&#39;s optimized one","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256703","Text":"Yes but i am not good at sql. It should be 4-5 tables in one temporary table and every query apply to queries that starts with a letter and when the a letters finished it will continue to others. at the end in query i posted should apply to all records.. @peterm","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256625","Text":"Is this a good option (i mean to say optimized one) to implement? can we use COALESCE to prepare string?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256573","Text":"Either use SQL fiddle (<a href=\"http://sqlfiddle.com/\" rel=\"nofollow\">sqlfiddle.com</a>) or just add a couple of row of data for each table to your original post.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256544","Text":"i mean i want to fetch the images per blog..\nand images per user...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256527","Text":"how can I insert it?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256498","Text":"My mistake.....","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256475","Text":"@HarjeetJadeja the way you pass the value to level order the same you pass the value to current level.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256441","Text":"this is helpful but this value <code>21,22,23</code> is coming dynamically, so i have to fetch updated <code>level_order</code> also.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256397","Text":"You mean total count ??","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256359","Text":"i have tried this one but the issue id it will set all values <code>21,22,23</code> to <code>current_level</code>.\nI want to set only first value that is <code>21</code>. And this values are dynamic.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256293","Text":"Thanx sir.. But then what will be the query to fetch total number of images in a blog?\n....And query for total number of images per user?..?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256188","Text":"great. Why did you tagged mysql then?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256130","Text":"Yes we can have more than one foreign key per table. the only constraint is we can only one primary key per table.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26256075","Text":"Sorry, I am using SQL SERVER2008","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26255990","Text":"Thanks It worked for me.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26255868","Text":"But is possible to enter 2 foreign keys in a single table ???U have entered 2 foreign keys in a single table BlogImage has 2 foreign keys..\nIS IT RIGHT??","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26255612","Text":"This is a good answer <b>if</b> you&#39;re working with MYSQL ;-)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26255549","Text":"We have given in above structure ImageId maps to BlogId in separate table.. so single image can be stored with multiple blogIds ,so satisfies your requirement. single image can be used in multiple blogs also","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26255489","Text":"The above table structure exactly matches your requirement..","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26255164","Text":"Ok welcome.....","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254992","Text":"Thanks selvam.. works fine","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254956","Text":"@user2636610 :I checked that, it is already updated mins ago.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254919","Text":"Yes.. I agree marc.. If temporary we want to move values into another table this option is fine otherwise not...","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254896","Text":"Although I just had to change the location of the case where in the select, I needed it on the mkt_segment rather than acct_code..but all good.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254852","Text":"Works, as long as <code>Table2</code> doesn&#39;t yet exist ....","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254794","Text":"Many thanks Ravi, that got me there, not just to work out why/how!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254674","Text":"@user2636610  : Does this help ?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254592","Text":"I forget to tell something \nA Blog will have multiple images and visa verse\nThat is a single image can also be used in multiple blogs...\nThen how will I set the relations?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254576","Text":"he dun want to use any join keyword~","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254324","Text":"I mean a single blog can have single author..but a single author can have multiple blogs..so what type of relation will it be?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26254308","Text":"thanks but how will i map it?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253615","Text":"@APC Good to know. Thanks.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253587","Text":"Tag order is determined by SO not the questioner. The tags are sorted by popularity.  More questions are tagged [mysql] than are tagged [oracle] so [mysql] comes first.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253536","Text":"how can I get the output as movieID, and movieName for movies that have less fans than average fans of movies of that respective genre. For example if action genre has 100 fans average per movie, and Rambo has 89 fans, and Rocky has 105 fans, I just want to get Rambo and Rambo&#39;s movie iD in output. Thanks again for your help","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253389","Text":"It&#39;ll work as is. After taking a closer look at the query though I don&#39;t think that was the problem. Can you post a couple of sample rows for each table along with an example of the expected result? Perhaps with a better understanding we can come up with a more efficient query.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253346","Text":"Thanks for your response, I was working on the problem and figured out a flaw in my logic which resulted in the conditional IF @PurchaserRegionID IS NOT NULL to always be false. I wasn&#39;t aware of the inserted table returns rows and not just one row :)","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26253191","Text":"Thanks for your response.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252953","Text":"so, what amendments do i make for your code?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252724","Text":"Actually, scratch that. That&#39;s only the case for dependent subqueries.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252684","Text":"you have to call every column using table name.\n(SELECT fulldate, realmatchid, isclanmatch -----&lt; fix that\n\nyour error is about that the sql can not understand which fulldate you ask.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252652","Text":"Also I agree 114 is not needed.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252574","Text":"@Krum110487 what version of SQL Server? If 2008+ you could not exists against a table-valued parameter. If earlier you could just populate a #temp table manually and do a not exists against that.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252547","Text":"it feels like there isnt a declaration of match?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252528","Text":"<code>Error Code: 1052\nColumn &#39;fulldate&#39; in field list is ambiguous</code>\n\nyea i have done that too.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252523","Text":"AH, this makes sense! The point to this code is for database generation, so basically for dev only, not a production script, just something to make my life easier, thanks!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252505","Text":"According to <a href=\"http://msdn.microsoft.com/en-us/library/ms186819.aspx\" rel=\"nofollow\">MSDN</a>, this is the <code>date</code> argument of <code>DATEADD</code>. Setting it to 0 fixes the problem. Brilliant!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252503","Text":"I really need to learn T-SQL, this helps immensely, all I need to do now is generate my list of current columns in the table and this will remove all the ones not listed! great!\n\nalso, is there an easier way to do a list of items instead of simply AND (name &lt;&gt; &#39;column 1 OR name &lt;&gt; &#39;column2&#39; OR name &lt;&gt; &#39;column3&#39;), this is what I plan on generating, I assume, I could simply generate that for the &quot;c&quot; variable.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252379","Text":"Actually it&#39;s giving me players who play for the same team and not playera who play exactly same teams. For example if player A plays for yankees and redsox, and player b plays for Yankees, Red Sox, and Dodgers I should not get them. They both have to play for Yankees, and Red Sox and no one else. Right now this query finds answer if players play for any same team.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252259","Text":"what is the error? fix this thing also :- group by yourTable.realmatchid","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252221","Text":"Thanks a lot, it makes sense now. only question. What do you mean by final joins?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252207","Text":"yea i did that. but it gave an error.\n\n\n<code>SELECT SUM(b.matchusertime)\nFROM(\nSELECT fulldate, realmatchid, isclanmatch\nFROM go_int.int_match a INNER JOIN go_int.int_match_user b \nON b.realmatchid = a.realmatchid \nWHERE (b.fulldate BETWEEN &#39;2013-06-30&#39; AND &#39;2013-07-27&#39;) AND b.isclanmatch = 0\nGROUP BY realmatchid)a</code>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252138","Text":"Is there any way to do this without using string-agg. Sorry, I am not familiar with the concept.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252094","Text":"in the where condition mention fulldate and isclanmatch  is from which table. for ex : - yourTable.fulldate and yourTable.isclanmatch","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252073","Text":"Ok the book with the theory is <a href=\"http://shop.oreilly.com/product/mobile/0636920022343.do\" rel=\"nofollow\">shop.oreilly.com/product/mobile/0636920022343.do</a> maybe ypu must read how oracle, mysql and postgresql manages repeateble read with MVCC. In Sql Server the history is very different","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26252048","Text":"hi, it returned an error (1052). stating fulldate is ambiguous","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251925","Text":"Thanks alot for your help, this works.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251922","Text":"I just upvoted as I have 15. Thanks a lot. I posted another question, if you have a time to take a look at it. Thanks again for help.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251898","Text":"thanks, thats what I thought.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251774","Text":"@user2636343 -- np, glad we could help!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251755","Text":"Thank you for you help!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251751","Text":"Thank you! This is exactly what I needed","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251726","Text":"@realnumber3012 -- completely agree -- using a <code>ranking function</code> would be a better solution for this RDBMS.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251656","Text":"double scan table! OVER CLAUSE opportunity came in SQL SERVER 2005.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251564","Text":"Ah. It is missing the validation on the second query. I will update it","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251522","Text":"You FAST)  sum(CASE WHEN leadtype_c = &#39;Referral&#39; THEN 1 ELSE 0 END) I want to added in my answer","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251494","Text":"Thanks a lot. This makes sense now. I don&#39;t have enough rep to bump :( but really appreciate your help.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251329","Text":"I want all players who play for ALL football teams.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251263","Text":"Putting aside deadlocks for now, you&#39;re saying I need <code>SERIALIZABLE</code> to prevent inserts if range-locks are used, and <code>REPEATABLE_READ</code> otherwise. Can you provide references for this answer in the form of the SQL standard or empirical evidence from multiple databases?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251259","Text":"Success (for the new query you supplied)!  Thank you.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251242","Text":"Yes, but in this context you need to check the blocking level, depending if it is set to table or level row you can fall on Blocking issues and dead locks.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251219","Text":"Does your answer hold if I replace the query by <code>SELECT * FROM users WHERE users.id = 5</code>? Meaning, does <code>REPEATABLE_READ</code> prevent inserts so long as I don&#39;t use range locks?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26251086","Text":"Maybe in a stored proc I could pull that off.  Actually, you&#39;ve got me thinking about maybe doing it offline with python if I can make the sql work.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250926","Text":"oh. i didn&#39;t got that from your description. you said &quot;The query finds player that plays for all football teams&quot;. What is the constraint that you want to do with football then?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250891","Text":"It&#39;s not giving the correct answer because it returns any players who have the same number of teams as the total number of football teams, but all the player&#39;s teams are not necessarily football.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250873","Text":"You can use implicit joins, which means comma-separated tables in the <code>FROM</code> clause like in your original. That is an old syntax, which is discouraged. The explicit <code>INNER JOIN</code> is equivalent, but the more modern preferred syntax. See also <a href=\"http://www.codinghorror.com/blog/2007/10/a-visual-explanation-of-sql-joins.html\" rel=\"nofollow\">codinghorror.com/blog/2007/10/&hellip;</a>","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250856","Text":"Actually it does compile but it&#39;s not giving me the correct answer for some reason.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250829","Text":"Thanks a lot. It definately works. I am not understanding the concept of Join On even after reading it up online. Is know natural join, and outer join etc. Is there any way to do this without using &quot;join on&quot; specifically.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250788","Text":"I&#39;m not sure what you mean by that. See the SQLFiddle that i inserted in the answer to see it working.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250721","Text":"It looks good but I don&#39;t think you can do aggregate functions in WHERE. You know anyway we can fix it?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250621","Text":"Possibly, possibly not.  I didn&#39;t know where I&#39;d find it - hence the ask to &quot;find&quot; first.  Now that I know where it is, I just edited my question to reflect my discovery.\nI will try your query and let you know how I go.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250478","Text":"@ReeceDodds You only need to find this information in a single column? Your question makes it sound like this will be in multiple columns across multiple tables.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250461","Text":"@user2632133 I think I have it now - it was not properly limited in the outer query. This should return everyone who plays for all football teams, but not <i>only</i> football teams. In other words, if someone plays for all football plus two baseball teams, he&#39;ll be in this result.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250458","Text":"I don&#39;t know if this will help, but I found the exact DB name, Table and Column that the html string would appear...\nDB = CMSDB, Table = dbo.tblContent, Column = ContentText.\nI&#39;m viewing this using &quot;SQL Server Management Studio Express&quot;. \nCan you adjust your query at all?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250419","Text":"Its exactly what I want but instead of every team, I just want every every team where SPORT = &#39;football&#39;","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250383","Text":"This is the find and replace. As written, it prints out the command it would execute (or at least the first 8kb of it, a limitation of PRINT, not a reflection that the command isn&#39;t complete), but won&#39;t execute it. If you review the output and believe it will work as advertised, uncomment the last few lines and run it again.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250357","Text":"Is this the &quot;find&quot; or the &quot;find and replace&quot;?","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26250078","Text":"You are welcome!","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26249999","Text":"Yuppp! I just tested it, success! thanks for the advice I should have known to use that.","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26249987","Text":"MAX(CASE\nWHEN r.role_name = &#39;role2&#39; THEN (SELECT user_id FROM job_roles WHERE job_id = j.job_id AND role_id = r.role_id)\nELSE &#39;&#39;\nEND) if field varchar type","Language":"sql"}
{"DataSource":"stackoverflow.com","CommentId":"26249979","Text":"Yes, You can use MAX CLAUSE for strings","Language":"sql"}