{"DataSource":"stackoverflow.com","CommentId":"26365572","Text":"I modified the question due to new developments I would to be able to draw lines in 3-dimensions. I got Quicklisp. Let me know if you have any more ideas. Thanks!","Language":"lisp"}
{"DataSource":"stackoverflow.com","CommentId":"26358247","Text":"@CodeKingPlusPlus I removed my now off topic answer (Non CL). A comment on sds&#39; answer will attract his attention to the changed question.","Language":"lisp"}
{"DataSource":"stackoverflow.com","CommentId":"26343285","Text":"Also: I&#39;ve tried those functions but they seems to be valid only to compile the <code>fas</code> file, not the <code>vlx</code>","Language":"lisp"}
{"DataSource":"stackoverflow.com","CommentId":"26338294","Text":"I&#39;ve already seen that set of instructions, and the undocumentation is the reason of my question :)","Language":"lisp"}
{"DataSource":"stackoverflow.com","CommentId":"26330774","Text":"<a href=\"http://en.wikipedia.org/wiki/Application_binary_interface\" rel=\"nofollow\">en.wikipedia.org/wiki/Application_binary_interface</a>","Language":"lisp"}
{"DataSource":"stackoverflow.com","CommentId":"26330043","Text":"What do you mean by ABI?","Language":"lisp"}
{"DataSource":"stackoverflow.com","CommentId":"26327701","Text":"ANSI Common Lisp has no support for graphics. This is platform specific. All decent Lisp implementations have an efficient foreign function interface (FFI) with which you can call just about any ABI in the system, regardless of how convoluted are the parameter passing conventions and their associated memory management.","Language":"lisp"}
{"DataSource":"stackoverflow.com","CommentId":"26326346","Text":"I&#39;m not positive, but I don&#39;t think you can. It&#39;s been awhile since I&#39;ve delt with lisp but I believe you have to compile inside of the VLIDE.","Language":"lisp"}
{"DataSource":"stackoverflow.com","CommentId":"26324643","Text":"I just fixed my question, please re-open. I need lots of advices.","Language":"lisp"}
{"DataSource":"stackoverflow.com","CommentId":"26296919","Text":"I don&#39;t want to load my application but to automatically build the vlx from lisp source file from outside autocad","Language":"lisp"}
{"DataSource":"stackoverflow.com","CommentId":"26290799","Text":"It looks like your are using <code>defconst</code> instead of <code>setq</code> or <code>custom-set-variables</code> to change existing variables. I could be wrong, but I don&#39;t think <code>defconst</code> is an acceptable substitute under those circumstances -- I&#39;d be interested to know one way or the other. I&#39;ve added a few samples of what does work within an answer below.","Language":"lisp"}
{"DataSource":"stackoverflow.com","CommentId":"26290289","Text":"Web integration <b>and</b> draw lines? The input/output library in Common Lisp can be used to produce SVG data.","Language":"lisp"}