{"DataSource":"stackoverflow.com","CommentId":"26315535","Text":"@dualed - as for me, treating out-of-range numbers and the infinity as usual numbers is very handy.  Integer arithmetic lacks this fine feature and forces you to always think of error handling on every step.","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26309785","Text":"Yes, but this is just the benchmark, @HolgerS wants to use it somewhere else too, obviously. Also... Since you address this, there may be different views on this, but most of the time I would have preferred an error to <code>1.#inf</code> when I encountered it.","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26305781","Text":"A second thought, system.getTimer() may be better. This function returns time in milliseconds since application launch. So you can have a variable, which stores last shot time. After that you can use it to check the difference between two shots. Since system.getTimer() is not about runtime, it will be more accurate then timer library functions. If you have further problems, I may write a little code block","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26304024","Text":"I&#39;ve looked a bit at os.time, and I&#39;m not sure how I would connect it to the function. Could you explain a bit more, I&#39;m still rather newish to Lua and Corona?","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26302098","Text":"Working with timer can be problematic sometimes. Did you try to implement the function with os.time function? That would be more accurate","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26301131","Text":"@dualed - conversion <code>k = k + str</code> would NEVER cause a Lua error if <code>str</code> was extracted by <code>%d+</code> pattern.  For very long <code>str</code> it would simply return NaN (namely, <code>1.#INF</code>) without raising any Lua error.","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26296488","Text":"Keep in mind that <code>tonumber()</code> can catch failed string-to-number conversions while <code>str+k</code> would cause a Lua error.","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26293945","Text":"@Etan yes that is what I meant, thanks.","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26293670","Text":"Did you mean indiscriminately?","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26293561","Text":"I come out of here truly enlightened!. Thank you greatwolf for the conscientious answer. However, I found @Etan&#39;s answer clearer(and I also read it first) so I&#39;m going to accept it. Again, thank you a lot. I wish the guy who wrote that script had used more helpful comments.","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26288115","Text":"Equivalent form of <code>spaces</code> calculation in function <code>rep(match)</code> without a loop: <code>local spaces = tab_width - #match % tab_width</code>","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26283856","Text":"Yes, this does make it a lot faster. Thanks.","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26276072","Text":"Thank you for your clear answer! Much appreciated ^_^","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26282908","Text":"I guess, your stageGroup is empty or just a black screen. Can you share more of your code?","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26269146","Text":"Sorry, a post by my brother while he was using my computer, I don&#39;t see it as a joke, and am quite serious about it, that it could seem somewhat comical, yes, but I included it as sourcing for where I got the script from, sorry for my brother&#39;s post, I didn&#39;t mean for there to be more argument over the first three commented lines of my code than the next hundred lines of real code, I just want my question answered, the posted code above is exactly what it looks like in my source file, I did not add the controversial comments &#39;just for&#39;. I can accept correction, but leave the link in?","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26264667","Text":"possible duplicate of <a href=\"http://stackoverflow.com/questions/14355806/corona-how-to-capture-a-screen-in-corona\">Corona: how to capture a screen in corona?</a>","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26264296","Text":"Perfect. Maybe I didnt phrase it the best way but you got my drift. Thanks a lot mate!","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26263544","Text":"If I understand your question correctly, you&#39;re trying to write an algorithm that will access some table element based on what you&#39;re thinking. And it will know what you&#39;re thinking by magically reading your mind somehow?","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26257599","Text":"What <code>AIRCRAFT_ROUTE</code> table is? Does it have value at index <code>5</code>? What you expect, and what you got?","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26257469","Text":"I don&#39;t get what&#39;s tripping you up.. That is a self contained example. I&#39;ll edit it a bit to try and make it a little easier to understand.","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26257426","Text":"Obviously there is a reason I need an algorthim to work out what part of the table I need to access or I wouldn&#39;t have asked...","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26257393","Text":"The best way to get a good answer is to provide a complete, self-contained example that illustrates your problem. This way, we have all the information required to propose a solution, and don&#39;t have to guess your actual problem.","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26257268","Text":"A better way to do what? It&#39;s not clear what you&#39;re trying to do. Is there some reason that you need an algorithm to generate a key?","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26255095","Text":"@JohnDoe you my find it a joke, but this is a programming question answer site, it offers nothing of value to the question, nor the site. Humor can be infused into posts, when and where appropriate. Accept that the community has spoken and we all have been corrected at times","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26253689","Text":"In my opinion, &quot;-- (Evil Steve)Because I&#39;m a kind and wonderful person: <a href=\"http://www.gamedev.net/topic/572784-lua-read-bitmap/&quot\" rel=\"nofollow\">gamedev.net/topic/572784-lua-read-bitmap/&quot</a>; is an odd way to give credit. If you want to credit the source, just say something like &quot;Original code by Evil Steve from <a href=\"http://www.gamedev.net/topic/572784-lua-read-bitmap/\" rel=\"nofollow\">here</a>&quot;.","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26252974","Text":"That was the permissions I was given the code under, and the username of the person who gave it to me, via a public post on a forum. I kept it there to give credit, since lua code is easily copyable, it could land in the hands of others, who might assume it was my original work(which it is not); as well as I don&#39;t want any legal problems, as it was posted without copy-write, I thought it wise to source it, as to not be interpreted as theft in the future.","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26252854","Text":"Then I was wrong to call it &quot;spam&quot; in the edit, sorry about that. But still, you should add the link in the question with some explanations, not in the code comment after the sentence: <i>(Evil Steve)Because I&#39;m a kind and wonderful person</i>. I still don&#39;t understand it now.","Language":"lua"}
{"DataSource":"stackoverflow.com","CommentId":"26252355","Text":"Yu Hao, I included a link to the source of this function, as I thought it might be usefull for people reviewing my post, to make comparisons and see what I changed, is this against stack overflow rules? I did not intend it to be &#39;spam&#39;","Language":"lua"}